[
  {
    "id": "TX-PAV-0001",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "You are driving on a four-lane highway and want to change from the left lane to the right lane. There is a solid white line between the lanes. What does this mean?",
    "choices": [
      "Lane changes are discouraged but not illegal — change only if necessary and safe",
      "Lane changes are strictly prohibited",
      "The line marks the boundary between opposing traffic flows",
      "The line indicates a merge area ahead"
    ],
    "correctIndex": 0,
    "explanation": "Solid white lines between same-direction lanes discourage lane changes but do not legally prohibit them. They are used in areas where lane changes are risky, such as near intersections or highway exits. Cross them only when necessary and after checking that it is safe to do so.",
    "reference": "MUTCD Section 3B.04; DL-7 Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_SOLID_WHITE_LINE"
    }
  },
  {
    "id": "TX-PAV-0002",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "On a three-lane highway, dashed white lines separate all three lanes. You want to move from the center lane to the right lane. Is this permitted?",
    "choices": [
      "Yes — dashed white lines indicate lane changes are allowed when safe",
      "No — you must stay in your lane until the next exit",
      "Only if you use your turn signal for at least 5 seconds first",
      "Only if a solid white line is not present on the other side"
    ],
    "correctIndex": 0,
    "explanation": "Dashed white lines separate lanes of same-direction traffic and indicate that lane changes are permitted. Always signal your intent, check mirrors and blind spots, and change lanes only when there is a safe gap in traffic.",
    "reference": "MUTCD Section 3B.04; DL-7 Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_DASHED_WHITE_LINE"
    }
  },
  {
    "id": "TX-PAV-0003",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "You are on a two-lane road and want to pass a slow-moving truck. The center line on your side is solid yellow and the line on the truck's side is dashed yellow. Are you legally allowed to pass?",
    "choices": [
      "No — the solid line on your side prohibits passing regardless of what the other side shows",
      "Yes — the dashed line on either side permits passing for both directions",
      "Yes — as long as no oncoming traffic is visible",
      "Only if the truck is traveling below the posted speed limit"
    ],
    "correctIndex": 0,
    "explanation": "When a double yellow center line has one solid and one dashed component, the rule applies to each side independently. The solid line on your side means passing is prohibited for you. The dashed line on the other side means oncoming traffic may pass when safe. This asymmetric marking is used where sight distance differs by direction — your direction has limited visibility for safe passing.",
    "reference": "MUTCD Section 3B.04; DL-7 Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_DOUBLE_YELLOW_SOLID"
    }
  },
  {
    "id": "TX-PAV-0004",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What is the primary difference between yellow and white pavement lines?",
    "choices": [
      "Yellow separates opposing traffic, white separates same-direction traffic",
      "Yellow means caution, white means proceed",
      "Yellow is for highways, white is for city streets",
      "Yellow marks parking areas, white marks driving lanes"
    ],
    "correctIndex": 0,
    "explanation": "Yellow lines separate traffic flowing in opposite directions, while white lines separate lanes of traffic moving in the same direction. This color coding helps drivers understand traffic flow patterns.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0005",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "When you see a single dashed yellow line, what does it indicate?",
    "choices": [
      "Passing is allowed when safe",
      "Passing is never permitted",
      "Two-way left turn lane",
      "Emergency vehicles only"
    ],
    "correctIndex": 0,
    "explanation": "A single dashed yellow line indicates that passing is permitted in both directions when it is safe to do so and you can see far enough ahead.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_SINGLE_YELLOW_DASHED"
    }
  },
  {
    "id": "TX-PAV-0006",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What does it mean when there is a double yellow line with one solid and one dashed line?",
    "choices": [
      "You can pass only if the dashed line is on your side",
      "You can pass from either direction",
      "No one can pass from either direction",
      "Only emergency vehicles can pass"
    ],
    "correctIndex": 0,
    "explanation": "With a solid/dashed combination, passing is allowed only from the side with the dashed line. If the solid line is on your side, you cannot pass.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_DOUBLE_YELLOW_MIXED"
    }
  },
  {
    "id": "TX-PAV-0007",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "While driving at night on an unfamiliar rural road, you notice a white line running along the right edge of the pavement. What is its purpose?",
    "choices": [
      "It marks where the paved roadway ends, helping you stay on the road",
      "It marks a bicycle lane that you must not cross",
      "It indicates a no-parking zone along the shoulder",
      "It marks a passing zone on the right side"
    ],
    "correctIndex": 0,
    "explanation": "White edge lines mark the right boundary of the roadway. They are especially helpful at night, in rain, or on unfamiliar roads because they give drivers a visible reference for staying within the travel lane. Drifting past the edge line means you are leaving the roadway.",
    "reference": "MUTCD Section 3B.08; DL-7 Pavement Markings"
  },
  {
    "id": "TX-PAV-0008",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "If you are driving and the solid yellow line is on your side with a dashed yellow line on the opposite side, what should you do?",
    "choices": [
      "Do not pass, passing is only allowed for opposing traffic",
      "Pass when safe to do so",
      "Pass only if no traffic is visible",
      "Slow down and prepare to stop"
    ],
    "correctIndex": 0,
    "explanation": "When the solid yellow line is on your side, you are prohibited from passing. Only vehicles on the side with the dashed line may pass when safe.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0009",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What do wider and more frequently spaced dashes in a white line indicate?",
    "choices": [
      "An exit or entrance lane is approaching",
      "Speed up to merge",
      "Construction zone ahead",
      "Emergency stopping area"
    ],
    "correctIndex": 0,
    "explanation": "Wider, more frequent dashes indicate a lane transition area where vehicles will be entering or exiting the roadway. This gives drivers advance warning to prepare for merging traffic.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0010",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does a yellow edge line on the left side of a divided highway indicate?",
    "choices": [
      "The left edge of traffic traveling in your direction",
      "A passing zone",
      "Emergency vehicle access",
      "A carpool lane"
    ],
    "correctIndex": 0,
    "explanation": "On divided highways, a yellow line on the left marks the left edge of your traffic lanes, separating your direction from the opposing traffic lanes or median.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0011",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "When approaching a solid white line at an intersection, what does it indicate?",
    "choices": [
      "You should not change lanes within the intersection",
      "You must stop immediately",
      "Turn only lanes ahead",
      "Pedestrian crossing area"
    ],
    "correctIndex": 0,
    "explanation": "Solid white lines at intersections discourage lane changes through the intersection, helping maintain orderly traffic flow and reducing collision risks.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0012",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "You are approaching an intersection and see a solid white line across your lane. Are you legally required to stop at this line?",
    "choices": [
      "Only if accompanied by a stop sign, red light, or other traffic control device",
      "Yes — all solid white lines require you to stop",
      "No — solid white lines are advisory only and never require a stop",
      "Only during school hours"
    ],
    "correctIndex": 0,
    "explanation": "A solid white line across a lane is a stop line that shows where to stop when required by a traffic signal, stop sign, or other control device. The line itself does not create a stop requirement — the accompanying signal or sign does. Without such a device, the line merely suggests a safe stopping point.",
    "reference": "MUTCD Section 3B.16; DL-7 Pavement Markings"
  },
  {
    "id": "TX-PAV-0013",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What is the purpose of longer dashed white lines with shorter gaps?",
    "choices": [
      "To mark a lane drop or merge area requiring extra caution",
      "To indicate higher speed limits",
      "To mark carpool lanes",
      "To designate truck lanes"
    ],
    "correctIndex": 0,
    "explanation": "Extended dashes with reduced gaps signal transition zones where lanes are ending or merging, alerting drivers to use extra caution and prepare for lane changes.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0014",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What does a double solid white line between lanes indicate?",
    "choices": [
      "Crossing is prohibited except in emergencies",
      "Lanes are for same direction but different vehicle types",
      "Passing is allowed when clear",
      "Parking is permitted on both sides"
    ],
    "correctIndex": 0,
    "explanation": "Double solid white lines indicate a barrier between lanes that should not be crossed except in emergency situations. These often separate HOV lanes or mark restricted zones.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0015",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "Why are yellow lines used instead of white on undivided two-way roads?",
    "choices": [
      "To warn drivers that oncoming traffic is in the adjacent lane",
      "To indicate construction zones",
      "To mark school zones",
      "To show speed limits"
    ],
    "correctIndex": 0,
    "explanation": "Yellow lines clearly identify that traffic on the other side is traveling in the opposite direction, providing an important visual warning about oncoming vehicles.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0016",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "When can you legally cross a double solid yellow line?",
    "choices": [
      "When turning left into or out of a driveway or side street",
      "When passing slower traffic",
      "When visibility is clear for at least 500 feet",
      "Never under any circumstances"
    ],
    "correctIndex": 0,
    "explanation": "While you cannot pass across double solid yellow lines, you may cross them to turn left into or out of driveways, alleys, or side streets when it is safe to do so.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0017",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What do broken white lines that become solid white lines indicate?",
    "choices": [
      "Lane changes should end, an intersection or restricted area is ahead",
      "Speed limit is increasing",
      "Emergency vehicles only beyond this point",
      "Parking is now allowed"
    ],
    "correctIndex": 0,
    "explanation": "The transition from broken to solid white lines warns drivers to complete lane changes before reaching an area where lane changes are discouraged, such as approaching intersections.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0018",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does it mean when yellow lines are painted on both sides of your lane?",
    "choices": [
      "You are in a center turn lane shared by traffic from both directions",
      "You are in a restricted zone",
      "You are driving the wrong way",
      "You are in a passing zone"
    ],
    "correctIndex": 0,
    "explanation": "Yellow lines on both sides indicate a two-way left turn lane that is shared by traffic from both directions for making left turns only.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0019",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "You are driving on a two-lane road and notice that the center line is yellow. The line on the right edge of your lane is white. Why are different colors used?",
    "choices": [
      "Yellow separates opposing traffic; white separates same-direction traffic or marks the road edge",
      "Yellow means caution; white means the lane is safe to travel in",
      "Yellow lines are older markings; white lines are newer",
      "Yellow is used on rural roads; white is used on urban roads"
    ],
    "correctIndex": 0,
    "explanation": "Yellow center lines always separate traffic moving in opposite directions, warning you that vehicles on the other side are coming toward you. White lines separate same-direction lanes or mark the road edge. This color system is standardized nationwide by the MUTCD so drivers can instantly understand lane configuration on any road.",
    "reference": "MUTCD Section 3B.01; DL-7 Pavement Markings"
  },
  {
    "id": "TX-PAV-0020",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "If you see solid yellow lines transitioning to dashed yellow lines, what is changing?",
    "choices": [
      "You are entering a zone where passing is now permitted",
      "The speed limit is decreasing",
      "A school zone is ahead",
      "You must change lanes"
    ],
    "correctIndex": 0,
    "explanation": "The transition from solid to dashed yellow lines indicates the end of a no-passing zone and the beginning of an area where passing is allowed when safe.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0021",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does a wide white edge line indicate?",
    "choices": [
      "The edge of the roadway, often used where extra visibility is needed",
      "A parking lane",
      "A bike path",
      "An emergency stopping zone"
    ],
    "correctIndex": 0,
    "explanation": "Wider white edge lines provide enhanced visibility of the roadway edge, especially useful in areas with limited lighting, curves, or poor weather conditions.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0022",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What is the significance of seeing a dashed yellow line that becomes solid yellow?",
    "choices": [
      "A no-passing zone is beginning, complete passes before reaching the solid line",
      "The road is ending",
      "A passing zone is starting",
      "Slow traffic must exit"
    ],
    "correctIndex": 0,
    "explanation": "This transition warns drivers that a no-passing zone is ahead. Any passing maneuver must be completed before reaching the solid yellow line.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0023",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 5,
    "text": "On a three-lane road with dashed yellow on both sides of the center lane, who can use the center lane?",
    "choices": [
      "Traffic from both directions for left turns only",
      "Only traffic traveling north or east",
      "Only emergency vehicles",
      "Faster traffic for passing"
    ],
    "correctIndex": 0,
    "explanation": "This describes a two-way left turn lane where drivers from both directions can enter briefly to make left turns. It is not for passing or through traffic.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0024",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What should you do when approaching an area where solid white lines separate multiple lanes in the same direction?",
    "choices": [
      "Avoid changing lanes and stay in your current lane",
      "Change lanes quickly before the lines become double",
      "Slow down to 25 mph",
      "Activate hazard lights"
    ],
    "correctIndex": 0,
    "explanation": "Solid white lines indicate that lane changes are discouraged in that area. Drivers should remain in their lane to maintain traffic flow and safety.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0025",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 5,
    "text": "Under what condition might you see both yellow and white lines together in the same lane area?",
    "choices": [
      "At a transition from one-way to two-way traffic flow",
      "In construction zones only",
      "At state borders",
      "In residential areas"
    ],
    "correctIndex": 0,
    "explanation": "Yellow and white lines together typically mark transitions between one-way streets (white lines) and two-way roads (yellow center line), helping drivers understand changing traffic patterns.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0026",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does a left turn arrow painted on the pavement indicate?",
    "choices": [
      "This lane must turn left",
      "Left turns are prohibited",
      "This is a passing lane",
      "Yield to left-turning traffic"
    ],
    "correctIndex": 0,
    "explanation": "A left turn arrow on the pavement indicates a mandatory turn lane. Vehicles in this lane must turn left at the intersection.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_ARROW_LEFT"
    }
  },
  {
    "id": "TX-PAV-0027",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "You are in a lane with a straight arrow painted on the pavement as you approach an intersection. You want to turn right. What should you do?",
    "choices": [
      "Proceed straight — the arrow requires you to continue through the intersection",
      "Turn right since the arrow only suggests a direction",
      "Turn right but signal your intention",
      "Stop and wait for the arrow to change"
    ],
    "correctIndex": 0,
    "explanation": "A straight pavement arrow indicates a mandatory lane-use direction. Vehicles in a lane marked with a straight arrow must proceed straight through the intersection. To turn right, you must be in a lane marked with a right-turn or combination arrow. Changing lanes at the last moment to turn is unsafe and often illegal.",
    "reference": "MUTCD Section 3B.20; DL-7 Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_ARROW_STRAIGHT"
    }
  },
  {
    "id": "TX-PAV-0028",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does the word 'ONLY' painted on the pavement indicate?",
    "choices": [
      "The lane is restricted to the designated direction or purpose shown",
      "Only one car allowed at a time",
      "Only buses permitted",
      "Emergency vehicles only"
    ],
    "correctIndex": 0,
    "explanation": "ONLY emphasizes that the lane is exclusively designated for a specific use, such as turning or a particular vehicle type, and cannot be used for other purposes.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_ONLY_TEXT"
    }
  },
  {
    "id": "TX-PAV-0029",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "As you approach a mid-block area, you see bold white zebra-stripe markings painted across the road. No traffic signal is present. What must you do?",
    "choices": [
      "Watch for pedestrians and yield to anyone within or about to enter the crosswalk",
      "Proceed at normal speed since there is no signal requiring you to stop",
      "Stop completely before the markings whether or not pedestrians are present",
      "Treat the markings as a speed bump and slow down slightly"
    ],
    "correctIndex": 0,
    "explanation": "Zebra-stripe markings designate a pedestrian crosswalk. Even without a traffic signal, drivers must yield to pedestrians within or about to enter a marked crosswalk. Failing to yield can result in a citation and, more importantly, endanger pedestrians who have the right-of-way.",
    "reference": "Texas Transportation Code §552.003; DL-7 Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_CROSSWALK_ZEBRA"
    }
  },
  {
    "id": "TX-PAV-0030",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does a thick white line across the lane at an intersection indicate?",
    "choices": [
      "The stopping point for traffic signals or stop signs",
      "A speed bump location",
      "A pedestrian-only zone",
      "A merge point"
    ],
    "correctIndex": 0,
    "explanation": "A stop line marks where vehicles must stop when required by a traffic signal, stop sign, or to yield to pedestrians. Vehicles should not enter the intersection beyond this line.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_STOP_LINE"
    }
  },
  {
    "id": "TX-PAV-0031",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What do white triangles pointing toward your vehicle indicate?",
    "choices": [
      "A yield line where you must give right-of-way",
      "Speed bumps ahead",
      "Sharp turn warning",
      "Lane ends"
    ],
    "correctIndex": 0,
    "explanation": "Yield line triangles point toward approaching traffic to indicate where drivers must yield right-of-way to other vehicles or pedestrians. This is common at roundabouts and yield intersections.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_YIELD_LINE"
    }
  },
  {
    "id": "TX-PAV-0032",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does a right turn arrow painted on the pavement mean?",
    "choices": [
      "This lane must turn right",
      "Right turns are prohibited",
      "Yield to right-turning traffic",
      "Right lane ends"
    ],
    "correctIndex": 0,
    "explanation": "A right turn arrow designates a mandatory right turn lane. Vehicles positioned in this lane must turn right and cannot proceed straight.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_ARROW_RIGHT"
    }
  },
  {
    "id": "TX-PAV-0033",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What does a combined left and straight arrow on the pavement indicate?",
    "choices": [
      "You may either turn left or continue straight from this lane",
      "You must choose left or straight before entering the lane",
      "Left turns have priority over straight traffic",
      "This is a passing lane"
    ],
    "correctIndex": 0,
    "explanation": "A combined arrow indicates an optional lane where drivers may either turn or proceed straight. Both movements are permitted from this lane.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_ARROW_LEFT_STRAIGHT"
    }
  },
  {
    "id": "TX-PAV-0034",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "When you see the word 'STOP' painted on the pavement, what does it indicate?",
    "choices": [
      "A stop line position even if the painted line is worn away",
      "School zone crossing",
      "Emergency stopping point",
      "Construction zone boundary"
    ],
    "correctIndex": 0,
    "explanation": "STOP painted on the pavement reinforces the stop requirement and shows where to stop, especially useful when stop lines have faded or in areas where the sign may be less visible.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0035",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What is the purpose of crosswalk markings at an intersection?",
    "choices": [
      "To designate the safe path for pedestrians crossing the street",
      "To indicate where vehicles should stop",
      "To mark parking boundaries",
      "To separate different traffic lanes"
    ],
    "correctIndex": 0,
    "explanation": "Crosswalk markings guide pedestrians across the street safely and alert drivers to areas where they must yield to foot traffic.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0036",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "If you see arrows and the word 'ONLY' together on the pavement, what does this combination mean?",
    "choices": [
      "The lane is exclusively for the movement shown by the arrow",
      "Only one vehicle at a time",
      "Commercial vehicles only",
      "Passing is permitted only in this lane"
    ],
    "correctIndex": 0,
    "explanation": "The combination of an arrow with ONLY creates a mandatory lane designation, meaning vehicles in that lane must follow the arrow's direction exclusively.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0037",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What should you do when you see a stop line at an intersection?",
    "choices": [
      "Stop with your front bumper at or before the line",
      "Stop with your rear bumper at the line",
      "Slow down but you don't need to stop",
      "Stop only if pedestrians are present"
    ],
    "correctIndex": 0,
    "explanation": "Vehicles must stop at or before the stop line, ensuring the entire vehicle is behind the line. This provides safe clearance for cross traffic and pedestrians.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0038",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What do school zone pavement markings typically indicate?",
    "choices": [
      "Reduced speed limits and increased pedestrian activity ahead",
      "Bus stops only",
      "No parking zones",
      "Emergency vehicle access"
    ],
    "correctIndex": 0,
    "explanation": "School zone pavement markings warn drivers to reduce speed and watch carefully for children and crossing guards. These areas require heightened awareness.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_SCHOOL_ZONE"
    }
  },
  {
    "id": "TX-PAV-0039",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 5,
    "text": "Why might you see a stop line positioned well back from the intersection?",
    "choices": [
      "To provide sight distance for turning vehicles or large truck clearance",
      "To create parking spaces",
      "To mark a pedestrian waiting area",
      "Because the marking was placed incorrectly"
    ],
    "correctIndex": 0,
    "explanation": "Stop lines are sometimes set back to improve sight lines at difficult intersections or to provide adequate turning radius for large vehicles like trucks and buses.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0040",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does 'NO PASSING ZONE' painted on the pavement mean?",
    "choices": [
      "Passing is prohibited in this area due to limited visibility or hazards",
      "You must drive in single file",
      "No trucks allowed",
      "Speed limit is reduced"
    ],
    "correctIndex": 0,
    "explanation": "NO PASSING ZONE pavement text reinforces that passing maneuvers are prohibited, typically due to limited sight distance, curves, or hills.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_NO_PASSING_ZONE"
    }
  },
  {
    "id": "TX-PAV-0041",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What does a combined right and straight arrow mean?",
    "choices": [
      "You may turn right or continue straight from this lane",
      "You must turn right, but straight traffic may pass on the left",
      "Right turns only during certain hours",
      "Yield to traffic going straight"
    ],
    "correctIndex": 0,
    "explanation": "A combined right-straight arrow indicates a shared lane where both right turns and through movements are permitted, giving drivers flexibility in their direction.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_ARROW_RIGHT_STRAIGHT"
    }
  },
  {
    "id": "TX-PAV-0042",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "If there is no marked crosswalk at an intersection, where should pedestrians cross?",
    "choices": [
      "At the extension of the sidewalk across the intersection",
      "Anywhere they choose",
      "Only at traffic signals",
      "Pedestrians cannot cross without markings"
    ],
    "correctIndex": 0,
    "explanation": "Even without painted markings, an unmarked crosswalk exists at intersections where sidewalks extend. Pedestrians have the right-of-way, and drivers must yield.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0043",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "While driving, you see the word 'ONLY' painted in white on the pavement along with a right-turn arrow. Why is this marking white rather than yellow?",
    "choices": [
      "White is used for lane-use markings because they guide same-direction traffic",
      "White indicates the marking is mandatory; yellow would make it advisory",
      "White markings are used in urban areas; yellow markings in rural areas",
      "White is easier to see at night than yellow"
    ],
    "correctIndex": 0,
    "explanation": "Pavement arrows, word markings, and lane-use symbols are white because they direct traffic traveling in the same direction. The MUTCD reserves yellow for markings that separate opposing traffic flows. This consistent color coding helps drivers instantly understand whether they are dealing with same-direction or opposing-direction guidance.",
    "reference": "MUTCD Section 3B.20; DL-7 Pavement Markings"
  },
  {
    "id": "TX-PAV-0044",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What should you do if you realize you are in a turn-only lane but need to go straight?",
    "choices": [
      "Complete the turn and find a safe way to return to your route",
      "Stop and back up to change lanes",
      "Go straight anyway",
      "Turn on hazard lights and stop"
    ],
    "correctIndex": 0,
    "explanation": "Once in a mandatory turn lane, you must complete the turn as indicated. Attempting to go straight or change lanes at the last moment creates dangerous situations.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0045",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 5,
    "text": "Why are some crosswalks marked with two parallel lines while others use zebra stripes?",
    "choices": [
      "Both are valid; zebra stripes provide higher visibility in high-traffic areas",
      "Zebra stripes are only for school zones",
      "Parallel lines mean yield, zebra means stop",
      "Different cities use different standards randomly"
    ],
    "correctIndex": 0,
    "explanation": "Both marking styles are legal crosswalks. Zebra stripes are often used in high-traffic or high-risk areas because they provide better visibility and draw more attention from drivers.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0046",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What is the primary purpose of white pavement markings?",
    "choices": [
      "To separate lanes of traffic moving in the same direction",
      "To separate opposing traffic",
      "To indicate parking areas",
      "To mark construction zones"
    ],
    "correctIndex": 0,
    "explanation": "White markings are used to organize and separate traffic moving in the same direction, helping drivers stay in proper lanes and make safe lane changes.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0047",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "A newly licensed driver asks you why the center line on their street is yellow while the lane lines on the highway are white. What is the correct explanation?",
    "choices": [
      "Yellow markings separate traffic flowing in opposite directions; white separates same-direction lanes",
      "Yellow means the road has a lower speed limit; white means higher speed",
      "Yellow is used on older roads; white on roads built after 2000",
      "There is no standard — cities choose their own colors"
    ],
    "correctIndex": 0,
    "explanation": "The color system is set by the MUTCD and used nationwide: yellow lines always separate opposing traffic flows (head-on risk), while white lines separate same-direction traffic or mark road edges. Understanding this distinction is critical — crossing a yellow line puts you in the path of oncoming vehicles.",
    "reference": "MUTCD Section 3B.01; DL-7 Pavement Markings"
  },
  {
    "id": "TX-PAV-0048",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What does a red curb indicate?",
    "choices": [
      "No stopping or parking at any time",
      "Fire lane parking only",
      "Emergency vehicle parking",
      "Loading zone"
    ],
    "correctIndex": 0,
    "explanation": "Red curbs designate no-stopping zones. Vehicles cannot stop, stand, or park in these areas, which are often near fire hydrants or emergency access points.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0049",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does a blue curb indicate?",
    "choices": [
      "Parking reserved for disabled persons with proper permits",
      "Police parking only",
      "Passenger loading zone",
      "Motorcycle parking"
    ],
    "correctIndex": 0,
    "explanation": "Blue curbs mark disabled parking spaces. Only vehicles displaying valid disabled parking permits or license plates may park in these designated areas.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0050",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does a white curb typically indicate?",
    "choices": [
      "Passenger loading and unloading only for a limited time",
      "No parking restrictions",
      "Disabled parking",
      "Emergency vehicles only"
    ],
    "correctIndex": 0,
    "explanation": "White curbs designate passenger loading zones where vehicles can stop briefly to pick up or drop off passengers but cannot park for extended periods.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0051",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What does a yellow curb indicate?",
    "choices": [
      "Loading zone or no parking during posted hours",
      "School zone",
      "Caution area",
      "Taxi stand only"
    ],
    "correctIndex": 0,
    "explanation": "Yellow curbs typically mark commercial loading zones where parking is prohibited but brief stops for loading/unloading are permitted during specified times.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0052",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What does a green curb indicate?",
    "choices": [
      "Limited time parking as posted",
      "Electric vehicle charging only",
      "Park and ride zone",
      "Environmentally friendly parking"
    ],
    "correctIndex": 0,
    "explanation": "Green curbs designate short-term parking areas with time limits, typically 15-30 minutes. These allow for brief stops while preventing all-day parking.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0053",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "Can you stop at a red curb to let a passenger out?",
    "choices": [
      "No, red curbs prohibit all stopping",
      "Yes, for up to 3 minutes",
      "Yes, if you stay in the vehicle",
      "Yes, during off-peak hours"
    ],
    "correctIndex": 0,
    "explanation": "Red curbs mean absolutely no stopping at any time. This includes dropping off passengers, as these areas must remain clear for emergency access or fire safety.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0054",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "Why do yellow and white lines have different meanings?",
    "choices": [
      "To help drivers quickly identify whether adjacent traffic is traveling the same or opposite direction",
      "Yellow is older, white is newer",
      "Different colors for different speed limits",
      "To distinguish urban from rural roads"
    ],
    "correctIndex": 0,
    "explanation": "The color-coding system provides instant visual information about traffic flow direction, which is critical for safety when deciding whether passing or lane changes are safe.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0055",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What does colored pavement in a bike lane indicate?",
    "choices": [
      "Enhanced visibility of the bike lane, especially at conflict points",
      "Bike racing area",
      "Bikes must stop",
      "Bikes have absolute right-of-way"
    ],
    "correctIndex": 0,
    "explanation": "Colored pavement in bike lanes increases visibility at intersections, driveways, or other locations where vehicle-bicycle conflicts are more likely to occur.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0056",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 5,
    "text": "What is the difference between a white curb and a blue curb?",
    "choices": [
      "White is for passenger loading, blue is for disabled parking only",
      "They mean the same thing",
      "White is daytime only, blue is 24-hours",
      "White is free, blue requires payment"
    ],
    "correctIndex": 0,
    "explanation": "White curbs allow brief stops for passenger loading by any vehicle, while blue curbs are exclusively reserved for vehicles with disabled parking credentials.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0057",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "When is parking at a green curb typically allowed?",
    "choices": [
      "For the limited time posted on nearby signs",
      "Only with a permit",
      "24 hours a day",
      "Only for electric vehicles"
    ],
    "correctIndex": 0,
    "explanation": "Green curbs indicate time-limited parking. Drivers must check posted signs for specific time limits and any applicable hours of enforcement.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0058",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What does it mean when the pavement in a bike lane is painted green?",
    "choices": [
      "It highlights conflict zones where drivers must be especially cautious of bicyclists",
      "Only green bikes can use this lane",
      "Environmentally friendly zone",
      "Bike lane ends ahead"
    ],
    "correctIndex": 0,
    "explanation": "Green pavement within bike lanes marks areas of potential conflict between bicycles and turning vehicles, alerting both to exercise extra caution.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0059",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "Are you required to park within white painted parking space lines?",
    "choices": [
      "Yes, to ensure adequate space for other vehicles and safe access",
      "No, they are only suggestions",
      "Only in paid parking lots",
      "Only if a parking attendant is present"
    ],
    "correctIndex": 0,
    "explanation": "White parking space lines must be observed to ensure orderly parking, accessibility, and adequate space for all vehicles and pedestrians.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0060",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 5,
    "text": "What legal difference exists between a solid yellow curb and a yellow curb with specific time restrictions posted?",
    "choices": [
      "Solid yellow may have restrictions that apply 24/7, while posted times indicate when restrictions are active",
      "No difference, both mean the same thing",
      "Solid yellow is more restrictive than posted times",
      "Posted times override the yellow curb meaning entirely"
    ],
    "correctIndex": 0,
    "explanation": "Yellow curbs must be evaluated based on posted signage. Without time-specific signs, restrictions may apply at all times. Posted signs specify exactly when loading is permitted or prohibited.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0061",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 2,
    "text": "What does a bicycle symbol painted on the pavement with a solid white line indicate?",
    "choices": [
      "A designated bike lane that vehicles should not enter",
      "Bicycles must exit the roadway",
      "Bicycle parking area",
      "Bicycle repair station"
    ],
    "correctIndex": 0,
    "explanation": "A bicycle symbol with a solid white line marks a dedicated bike lane. Motor vehicles should not drive or park in these lanes except when necessary to turn.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_BIKE_LANE"
    }
  },
  {
    "id": "TX-PAV-0062",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What does a white diamond symbol painted on the pavement indicate?",
    "choices": [
      "A high-occupancy vehicle (HOV) or carpool lane",
      "Jewelry store ahead",
      "Premium parking",
      "Diamond-shaped intersection ahead"
    ],
    "correctIndex": 0,
    "explanation": "Diamond symbols mark HOV lanes reserved for vehicles with multiple occupants. Check posted signs for specific occupancy requirements and hours of operation.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_HOV_DIAMOND"
    }
  },
  {
    "id": "TX-PAV-0063",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What does a bicycle symbol with chevron markings (sharrow) indicate?",
    "choices": [
      "A shared lane where bicycles and vehicles both have right to use the full lane",
      "Bicycles must stay to the right",
      "Bicycle crossing ahead",
      "Bicycles prohibited"
    ],
    "correctIndex": 0,
    "explanation": "Sharrows indicate shared lane usage where bicycles and motor vehicles share the travel lane. They remind drivers that cyclists have the right to use the full lane.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_SHARROW"
    }
  },
  {
    "id": "TX-PAV-0064",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What do the pavement markings for a center two-way left turn lane look like?",
    "choices": [
      "Yellow lines on both sides with breaks and arrows pointing in both directions",
      "Solid white lines on both sides",
      "Single dashed yellow line in the center",
      "Double solid yellow lines"
    ],
    "correctIndex": 0,
    "explanation": "Center turn lanes have distinctive yellow lines on both sides with arrows showing that traffic from both directions uses this lane exclusively for left turns, not through travel.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_TURN_LANE_CENTER"
    }
  },
  {
    "id": "TX-PAV-0065",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What does an X with the letters RR painted on the pavement indicate?",
    "choices": [
      "Railroad crossing ahead",
      "Road repair zone",
      "Rest area exit",
      "Restricted route"
    ],
    "correctIndex": 0,
    "explanation": "The RR with an X marking warns drivers that railroad tracks cross the road ahead. Drivers should slow down and look for trains before crossing.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_RAILROAD_CROSSING_X"
    }
  },
  {
    "id": "TX-PAV-0066",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 5,
    "text": "How should you use a center two-way left turn lane?",
    "choices": [
      "Enter only to prepare for a left turn, not for passing or through travel",
      "Use it to pass slow-moving vehicles",
      "Use it to merge into traffic",
      "Use it as a continuous travel lane"
    ],
    "correctIndex": 0,
    "explanation": "Center turn lanes are exclusively for preparing to turn left. Drivers should enter the lane close to their turning point and not use it for passing or extended travel.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0067",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 3,
    "text": "What does a handicapped parking symbol painted on the pavement indicate?",
    "choices": [
      "Parking space reserved for vehicles displaying disabled parking credentials",
      "Accessible route to building entrance",
      "Wheelchair rental location",
      "Medical facility parking"
    ],
    "correctIndex": 0,
    "explanation": "The wheelchair symbol marks parking spaces legally reserved for people with disabilities who display valid disabled parking permits or license plates.",
    "reference": "DL-7: Pavement Markings",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_HANDICAP_SYMBOL"
    }
  },
  {
    "id": "TX-PAV-0068",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "Can you drive in a bike lane to prepare for a right turn?",
    "choices": [
      "Yes, you should merge into the bike lane within 200 feet of the turn when safe",
      "No, never enter a bike lane",
      "Yes, at any distance from the turn",
      "Only if no bicycles are visible"
    ],
    "correctIndex": 0,
    "explanation": "Drivers should merge into the bike lane before turning right to avoid cutting off cyclists. Check for bicyclists, signal, and merge safely within 200 feet of the intersection.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0069",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 5,
    "text": "What is the purpose of a sharrow versus a dedicated bike lane?",
    "choices": [
      "Sharrows indicate shared use of the lane, while bike lanes provide exclusive space for bicycles",
      "Sharrows are for faster cyclists only",
      "They mean exactly the same thing",
      "Sharrows are temporary, bike lanes are permanent"
    ],
    "correctIndex": 0,
    "explanation": "Sharrows are used where space is insufficient for a separate bike lane, reminding drivers that cyclists have equal rights to the lane. Bike lanes provide dedicated space separated by lines.",
    "reference": "DL-7: Pavement Markings"
  },
  {
    "id": "TX-PAV-0070",
    "topic": "PAVEMENT_MARKINGS",
    "difficulty": 4,
    "text": "What should you do when approaching an HOV lane marked with diamonds?",
    "choices": [
      "Check posted signs for occupancy requirements and hours before entering",
      "Enter only during rush hour",
      "Enter if your vehicle has two or more axles",
      "These lanes are for emergency vehicles only"
    ],
    "correctIndex": 0,
    "explanation": "HOV lanes have varying requirements for number of occupants and restricted hours. Always check posted signage before entering to ensure compliance with current regulations.",
    "reference": "DL-7: Pavement Markings"
  }
]
