[
  {
    "id": "TX-SIG-0001",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "You are teaching a new driver and they ask why STOP signs have a unique shape. What is the reason for the octagonal design?",
    "choices": [
      "So drivers can recognize it instantly — even from behind or when covered in snow",
      "The eight sides represent the eight seconds you should wait before proceeding",
      "It is the only shape that can be seen from all angles equally",
      "Federal law requires red signs to have at least eight sides"
    ],
    "correctIndex": 0,
    "explanation": "The STOP sign's unique octagonal shape is designed for instant recognition under any condition — at night, from behind, or when obscured by snow or dirt. No other traffic sign uses this shape, making it identifiable by silhouette alone. This design principle has been part of the MUTCD since 1954.",
    "reference": "MUTCD Section 2B.03; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R1-1_STOP"
    }
  },
  {
    "id": "TX-SIG-0002",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "You approach an intersection with a yield sign. There is a steady stream of cross traffic. What is required of you?",
    "choices": [
      "Slow down and stop if necessary — you must wait for a safe gap before entering",
      "Come to a complete stop regardless of traffic conditions",
      "Merge into traffic at your current speed — cross traffic must adjust",
      "Proceed without slowing if the road ahead appears clear"
    ],
    "correctIndex": 0,
    "explanation": "A yield sign requires you to slow down and give right-of-way to all vehicles and pedestrians on the intersecting road. If traffic is continuous, you must stop and wait for a safe gap. Unlike a stop sign, you are not required to stop if there is no conflicting traffic, but you must be prepared to do so.",
    "reference": "MUTCD Section 2B.08; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R1-2_YIELD"
    }
  },
  {
    "id": "TX-SIG-0003",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What is the shape of a YIELD sign?",
    "choices": [
      "Downward-pointing triangle",
      "Upward-pointing triangle",
      "Diamond",
      "Pentagon"
    ],
    "correctIndex": 0,
    "explanation": "YIELD signs are uniquely shaped as downward-pointing triangles with a red border and white background, making them easily distinguishable from other traffic signs.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R1-2_YIELD"
    }
  },
  {
    "id": "TX-SIG-0004",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "You are driving on a highway and see a white rectangular sign reading 'SPEED LIMIT 65.' Heavy rain begins falling. Must you still drive at 65 mph?",
    "choices": [
      "No — the sign shows the maximum speed for ideal conditions; you must reduce speed for safety",
      "Yes — the posted speed is the legal requirement in all conditions",
      "Only if visibility drops below 100 feet",
      "No — the speed limit automatically drops by 10 mph in rain"
    ],
    "correctIndex": 0,
    "explanation": "Speed limit signs show the maximum legal speed under ideal conditions. Texas law requires drivers to reduce speed when conditions such as rain, fog, ice, or heavy traffic make the posted limit unsafe. Driving at the posted speed in poor conditions can constitute reckless driving even though you are not exceeding the limit.",
    "reference": "Texas Transportation Code §545.351; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R2-1_SPEED_LIMIT_65"
    }
  },
  {
    "id": "TX-SIG-0005",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What must you do when you see a DO NOT ENTER sign?",
    "choices": [
      "Do not proceed in that direction",
      "Proceed with caution",
      "Only commercial vehicles are prohibited",
      "Stop and check for traffic"
    ],
    "correctIndex": 0,
    "explanation": "DO NOT ENTER signs prohibit entry into a roadway or area, typically marking wrong-way entry points on one-way streets or exit ramps.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R5-1_DO_NOT_ENTER"
    }
  },
  {
    "id": "TX-SIG-0006",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "If you see a WRONG WAY sign, you should:",
    "choices": [
      "Immediately pull over safely and turn around",
      "Continue if no traffic is visible",
      "Sound your horn to warn others",
      "Speed up to exit quickly"
    ],
    "correctIndex": 0,
    "explanation": "A WRONG WAY sign means you are traveling in the wrong direction on a one-way road or ramp. You must safely pull over and turn around immediately to avoid a head-on collision.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R5-1a_WRONG_WAY"
    }
  },
  {
    "id": "TX-SIG-0007",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "You approach an intersection and see a sign with a left-turn arrow crossed out by a red circle and slash. You need to reach a business on the left side of the cross street. What should you do?",
    "choices": [
      "Proceed past the intersection and find an alternate route — left turns are prohibited here",
      "Turn left carefully since the sign is only advisory",
      "Make a U-turn past the intersection and approach from the other direction",
      "Turn left only if no oncoming traffic is present"
    ],
    "correctIndex": 0,
    "explanation": "A No Left Turn sign (MUTCD R3-1) is a regulatory sign that legally prohibits left turns at that location. Violating it can result in a traffic citation. The sign is typically placed where left turns create sight-distance problems or dangerous conflicts with oncoming traffic. Find an alternative route such as turning right and circling the block.",
    "reference": "MUTCD Section 2B.18; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R3-1_NO_LEFT_TURN"
    }
  },
  {
    "id": "TX-SIG-0008",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "When you see a NO RIGHT TURN sign at an intersection, you must:",
    "choices": [
      "Not turn right at that location",
      "Turn right only after stopping",
      "Turn right only on green",
      "Yield before turning right"
    ],
    "correctIndex": 0,
    "explanation": "NO RIGHT TURN signs prohibit right turns at that specific location, often due to safety concerns or traffic flow patterns.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R3-2_NO_RIGHT_TURN"
    }
  },
  {
    "id": "TX-SIG-0009",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "You are driving on a divided highway and see a No U-Turn sign at a median opening. You just passed your destination. What should you do?",
    "choices": [
      "Continue to the next legal turning point — U-turns are prohibited at this location",
      "Make a U-turn if no traffic is coming since the sign is advisory",
      "Make a three-point turn instead, since only U-turns are prohibited",
      "Make the U-turn but yield to oncoming traffic"
    ],
    "correctIndex": 0,
    "explanation": "No U-Turn signs are regulatory and legally binding. They are placed where U-turns are particularly dangerous — often at median openings with limited sight distance. Continue to the next legal turning point, intersection, or driveway where you can safely reverse direction. A three-point turn at a median opening would be equally dangerous.",
    "reference": "MUTCD Section 2B.19; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R3-3_NO_U_TURN"
    }
  },
  {
    "id": "TX-SIG-0010",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a NO PARKING ANYTIME sign mean?",
    "choices": [
      "Parking is never permitted at this location",
      "Parking allowed only for loading",
      "No parking during business hours",
      "Parking allowed on weekends"
    ],
    "correctIndex": 0,
    "explanation": "NO PARKING ANYTIME signs prohibit parking at all times, 24 hours a day, 7 days a week, with no exceptions unless specifically noted.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R8-3a_NO_PARKING_ANYTIME"
    }
  },
  {
    "id": "TX-SIG-0011",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "You turn onto a street and immediately notice a One Way sign with an arrow pointing to the right. You need to go left. What must you do?",
    "choices": [
      "Do not go left — you must travel only in the direction the arrow indicates",
      "You may go left if you stay in the leftmost lane",
      "You may go left only if no other vehicles are on the street",
      "The sign applies only to commercial vehicles"
    ],
    "correctIndex": 0,
    "explanation": "One Way signs indicate that all traffic on that street must travel in the direction of the arrow. Driving against a One Way sign means traveling into the path of oncoming traffic, which is extremely dangerous and illegal. If you need to go in the opposite direction, you must find an alternate route using adjacent streets.",
    "reference": "MUTCD Section 2B.40; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R10-6_ONE_WAY"
    }
  },
  {
    "id": "TX-SIG-0012",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a DO NOT PASS sign indicate?",
    "choices": [
      "Passing is prohibited in this zone",
      "Pass only on the right",
      "Pass only when safe",
      "No trucks allowed to pass"
    ],
    "correctIndex": 0,
    "explanation": "DO NOT PASS signs mark areas where passing is prohibited due to limited visibility or other hazards, and violating this can result in head-on collisions.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R10-7_DO_NOT_PASS"
    }
  },
  {
    "id": "TX-SIG-0013",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does this sign indicate about railroad crossings?",
    "choices": [
      "A railroad crossing is ahead",
      "Railroad traffic has priority",
      "Trains run only during daytime",
      "Sound horn before crossing"
    ],
    "correctIndex": 0,
    "explanation": "The railroad crossing sign warns drivers that train tracks cross the roadway ahead. Always look both ways and be prepared to stop for approaching trains.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R15-1_RAILROAD_CROSSING"
    }
  },
  {
    "id": "TX-SIG-0014",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What does a NO TRUCKS sign typically prohibit?",
    "choices": [
      "Commercial vehicles above a certain weight",
      "All pickup trucks",
      "Delivery vehicles at all times",
      "Trucks during daytime only"
    ],
    "correctIndex": 0,
    "explanation": "NO TRUCKS signs typically prohibit commercial trucks above a specified weight limit from using that road, often to protect residential areas or roads not designed for heavy vehicles.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R3-4_NO_TRUCKS"
    }
  },
  {
    "id": "TX-SIG-0015",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a KEEP RIGHT sign require you to do?",
    "choices": [
      "Stay to the right of an obstruction or divider",
      "Drive in the right lane only",
      "Pass on the right side",
      "Turn right at the next intersection"
    ],
    "correctIndex": 0,
    "explanation": "KEEP RIGHT signs direct drivers to pass to the right side of an island, median, or other obstruction in the roadway.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R4-7_KEEP_RIGHT"
    }
  },
  {
    "id": "TX-SIG-0016",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a LEFT TURN ONLY sign indicate?",
    "choices": [
      "Vehicles in this lane must turn left",
      "Left turns are optional",
      "Only left turns are allowed at this intersection",
      "Left lane is for turning only"
    ],
    "correctIndex": 0,
    "explanation": "LEFT TURN ONLY signs indicate that traffic in the marked lane must turn left and cannot proceed straight or turn right.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R6-1_LEFT_TURN_ONLY"
    }
  },
  {
    "id": "TX-SIG-0017",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "If you are in a lane marked with a RIGHT TURN ONLY sign, you must:",
    "choices": [
      "Turn right from that lane",
      "Merge left before the intersection",
      "Stop before turning",
      "Yield to pedestrians only"
    ],
    "correctIndex": 0,
    "explanation": "RIGHT TURN ONLY signs indicate that vehicles in that lane are required to turn right and may not go straight or turn left.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R6-2_RIGHT_TURN_ONLY"
    }
  },
  {
    "id": "TX-SIG-0018",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What is the penalty for parking in a space marked with a HANDICAPPED PARKING sign without proper authorization?",
    "choices": [
      "Substantial fine and possible towing",
      "Warning citation only",
      "No penalty if brief",
      "Fine only for commercial vehicles"
    ],
    "correctIndex": 0,
    "explanation": "Parking in handicapped spaces without proper permits or plates results in substantial fines (typically $500+) and possible vehicle towing in Texas.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R7-107_HANDICAPPED_PARKING"
    }
  },
  {
    "id": "TX-SIG-0019",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "At a STOP sign, you must stop:",
    "choices": [
      "Before the stop line, crosswalk, or intersection",
      "Within 10 feet of the sign",
      "Only if other vehicles are present",
      "Where you can see traffic clearly"
    ],
    "correctIndex": 0,
    "explanation": "You must come to a complete stop before the stop line, before the crosswalk if present, or before entering the intersection if neither is marked.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0020",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What color are most regulatory signs?",
    "choices": [
      "White background with black or red symbols",
      "Yellow background with black symbols",
      "Green background with white symbols",
      "Blue background with white symbols"
    ],
    "correctIndex": 0,
    "explanation": "Regulatory signs typically have a white background with black text or symbols, or red symbols for prohibitions. These signs tell you what you must or must not do.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0021",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "If a speed limit sign shows 70 mph, but weather conditions are poor, you should:",
    "choices": [
      "Drive slower than the posted limit based on conditions",
      "Maintain exactly 70 mph as posted",
      "Drive 10 mph below the limit",
      "Use hazard lights and maintain speed"
    ],
    "correctIndex": 0,
    "explanation": "Speed limits indicate the maximum safe speed under ideal conditions. Drivers must reduce speed in rain, fog, ice, or other hazardous conditions.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R2-1_SPEED_LIMIT_70"
    }
  },
  {
    "id": "TX-SIG-0022",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "You see a school speed limit sign showing 20 mph with flashing beacons. It is 3:30 PM on a Tuesday. The beacons are not flashing. Must you drive at 20 mph?",
    "choices": [
      "Not necessarily — the 20 mph limit applies when the beacons are flashing or during posted times",
      "Yes — school zone speed limits apply 24 hours a day",
      "No — school speed limits only apply before 8 AM",
      "Only if children are physically visible on the sidewalks"
    ],
    "correctIndex": 0,
    "explanation": "School zone speed limits in Texas apply when the beacons are flashing or during times posted on the sign. If the beacons are off and the current time is outside posted hours, the regular speed limit applies. However, always watch for children — you may be cited for unsafe speed near a school regardless of the posted limit.",
    "reference": "Texas Transportation Code §545.3561; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_S4-3_SCHOOL_SPEED_LIMIT_20"
    }
  },
  {
    "id": "TX-SIG-0023",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A red circle with a red slash over a black symbol on a white background indicates:",
    "choices": [
      "A prohibited action",
      "A required action",
      "A warning of hazard",
      "A guide to services"
    ],
    "correctIndex": 0,
    "explanation": "The red circle with a diagonal slash is the international prohibition symbol, indicating that the action shown is not permitted.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0024",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What is the minimum speed you should drive on a road with a 65 mph speed limit in Texas?",
    "choices": [
      "There is no minimum unless posted separately",
      "45 mph",
      "55 mph",
      "40 mph"
    ],
    "correctIndex": 0,
    "explanation": "Unless a separate minimum speed limit is posted, there is no specific minimum speed, but driving unreasonably slow can be unsafe and illegal.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0025",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "Where are you most likely to see a NO PARKING sign?",
    "choices": [
      "Near fire hydrants, intersections, or driveways",
      "On residential streets only",
      "Only in commercial zones",
      "On highways and freeways"
    ],
    "correctIndex": 0,
    "explanation": "NO PARKING signs are placed where parking would create safety hazards or block emergency access, such as near fire hydrants, intersections, and building entrances.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R7-8_NO_PARKING"
    }
  },
  {
    "id": "TX-SIG-0026",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "Which sign would you expect to see at the entrance ramp to a highway going the wrong direction?",
    "choices": [
      "Both DO NOT ENTER and WRONG WAY signs",
      "Only a STOP sign",
      "Only a YIELD sign",
      "A speed limit sign only"
    ],
    "correctIndex": 0,
    "explanation": "Highway exit ramps typically have both DO NOT ENTER and WRONG WAY signs to prevent wrong-way drivers from entering, using redundancy for safety.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0027",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A residential street with a speed limit of 30 mph means:",
    "choices": [
      "30 mph is the maximum legal speed",
      "30 mph is recommended but not required",
      "30 mph applies only during daytime",
      "30 mph is for passenger vehicles only"
    ],
    "correctIndex": 0,
    "explanation": "Posted speed limits are legal maximums that apply at all times unless otherwise specified, and apply to all vehicles unless the sign indicates otherwise.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R2-1_SPEED_LIMIT_30"
    }
  },
  {
    "id": "TX-SIG-0028",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "If you encounter both a YIELD sign and a stopped school bus with flashing red lights, which takes priority?",
    "choices": [
      "The school bus - you must stop",
      "The YIELD sign - you may proceed with caution",
      "Both equally - stop and yield",
      "Whichever you encounter first"
    ],
    "correctIndex": 0,
    "explanation": "A school bus with flashing red lights creates an absolute stop requirement that overrides YIELD signs. You must stop until the bus turns off its lights.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0029",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "At an intersection with a STOP sign and a malfunctioning traffic signal, how should you proceed?",
    "choices": [
      "Treat it as a four-way stop if multiple approaches have signals",
      "The STOP sign overrides the signal - stop and go",
      "Proceed with caution without stopping",
      "Wait for signal to function before proceeding"
    ],
    "correctIndex": 0,
    "explanation": "When traffic signals malfunction at an intersection, drivers should treat it as an all-way stop, with vehicles taking turns in order of arrival.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0030",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does it mean if a NO PARKING sign has an arrow pointing right?",
    "choices": [
      "No parking from the sign onward in that direction",
      "No parking only to the right of the sign",
      "Park on the right side only",
      "Right lane parking prohibited"
    ],
    "correctIndex": 0,
    "explanation": "Arrows on NO PARKING signs indicate the direction and extent of the parking restriction from that sign location.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0031",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "At a railroad crossing with both signals and a STOP sign, when must you stop?",
    "choices": [
      "When signals are flashing or a train is approaching",
      "At all times before crossing",
      "Only if a train is visible",
      "Only during daytime hours"
    ],
    "correctIndex": 0,
    "explanation": "At railroad crossings with signals, you must stop when lights flash or gates lower. Some crossings also have STOP signs requiring stops regardless of signals.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0032",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "While driving on a rural road, you see a yellow diamond-shaped sign with a curve symbol. What type of sign is this, and what should you do?",
    "choices": [
      "It is a warning sign — reduce speed because a curve or hazard is ahead",
      "It is a regulatory sign — you must follow the direction shown",
      "It is a guide sign — it shows the direction to a nearby town",
      "It is a construction sign — slow to the work zone speed limit"
    ],
    "correctIndex": 0,
    "explanation": "Diamond-shaped yellow signs are warning signs that alert drivers to upcoming road conditions, curves, or hazards. They are advisory, not regulatory — meaning they do not set a legal speed — but ignoring them is dangerous. A curve warning often includes an advisory speed plaque below it suggesting a safe speed for the curve.",
    "reference": "MUTCD Section 2C.02; DL-7 Traffic Signs"
  },
  {
    "id": "TX-SIG-0033",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a CURVE RIGHT warning sign indicate?",
    "choices": [
      "The road curves to the right ahead",
      "Turn right at the next intersection",
      "Right lane curves away",
      "Keep to the right of the curve"
    ],
    "correctIndex": 0,
    "explanation": "CURVE RIGHT warning signs alert drivers that the roadway ahead curves to the right, allowing them to reduce speed appropriately before entering the curve.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W1-1_CURVE_RIGHT"
    }
  },
  {
    "id": "TX-SIG-0034",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "When you see a CURVE LEFT sign, you should:",
    "choices": [
      "Slow down before entering the curve",
      "Maintain speed through the curve",
      "Shift to the right lane",
      "Accelerate through the curve"
    ],
    "correctIndex": 0,
    "explanation": "Warning signs for curves indicate you should reduce speed before entering the curve to maintain control, especially if the curve is sharp or visibility is limited.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W1-2_CURVE_LEFT"
    }
  },
  {
    "id": "TX-SIG-0035",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a WINDING ROAD sign warn you about?",
    "choices": [
      "A series of curves ahead",
      "One sharp curve ahead",
      "Road surface is uneven",
      "Wind gusts are common"
    ],
    "correctIndex": 0,
    "explanation": "WINDING ROAD signs warn that there are multiple curves ahead in succession, requiring continued vigilance and reduced speed.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W1-6_WINDING_ROAD"
    }
  },
  {
    "id": "TX-SIG-0036",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What does a SIDE ROAD warning sign indicate?",
    "choices": [
      "Another road intersects from the side",
      "Stay in your lane",
      "Side road parking available",
      "Exit ramp ahead"
    ],
    "correctIndex": 0,
    "explanation": "SIDE ROAD signs warn that another road intersects from the left or right, alerting you to watch for vehicles entering from that direction.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W2-1_SIDE_ROAD"
    }
  },
  {
    "id": "TX-SIG-0037",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What type of intersection does a Y-INTERSECTION warning sign indicate?",
    "choices": [
      "The road splits into two roads ahead",
      "Three roads meet in a Y-shape",
      "A yield is required",
      "Yellow light ahead"
    ],
    "correctIndex": 0,
    "explanation": "Y-INTERSECTION signs warn that the road ahead divides into two separate roads, requiring you to choose which direction to take.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W2-2_Y_INTERSECTION"
    }
  },
  {
    "id": "TX-SIG-0038",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "A T-INTERSECTION warning sign means:",
    "choices": [
      "The road ends ahead at a cross street",
      "Three roads meet",
      "Turn only",
      "Traffic light ahead"
    ],
    "correctIndex": 0,
    "explanation": "T-INTERSECTION signs warn that the road you are on ends ahead at an intersection with a cross street, requiring you to turn left or right.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W2-3_T_INTERSECTION"
    }
  },
  {
    "id": "TX-SIG-0039",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a MERGE warning sign indicate?",
    "choices": [
      "Traffic from another road is entering your lane",
      "You must merge into another lane",
      "Two lanes become one",
      "Yield to merging traffic"
    ],
    "correctIndex": 0,
    "explanation": "MERGE signs warn that traffic from another roadway will be entering and merging with your lane, requiring increased awareness and possible speed adjustment.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W3-1_MERGE"
    }
  },
  {
    "id": "TX-SIG-0040",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A LANE ENDS MERGE sign indicates:",
    "choices": [
      "Your lane will end and you must merge into the adjacent lane",
      "An additional lane is being added",
      "The merge lane is ending",
      "All lanes merge ahead"
    ],
    "correctIndex": 0,
    "explanation": "LANE ENDS MERGE signs warn that the lane you are in will end soon, requiring you to safely merge into the continuing lane before your lane terminates.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W4-2_LANE_ENDS_MERGE"
    }
  },
  {
    "id": "TX-SIG-0041",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a HILL warning sign indicate?",
    "choices": [
      "A steep grade or hill is ahead",
      "Hill parking rules apply",
      "Trucks must use lower gear",
      "Slow vehicles keep right"
    ],
    "correctIndex": 0,
    "explanation": "HILL warning signs alert drivers to steep grades ahead, warning them to prepare for reduced visibility over the crest or the need for braking on downhill sections.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W8-1_HILL"
    }
  },
  {
    "id": "TX-SIG-0042",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "You are driving at 40 mph and see a yellow diamond sign showing a pedestrian symbol ahead. There is no crosswalk or traffic signal visible yet. What should you do?",
    "choices": [
      "Slow down and be alert — pedestrians frequently cross at this location",
      "Maintain speed since there is no crosswalk or signal",
      "Stop and look both ways before continuing",
      "Change lanes to the lane farthest from the sign"
    ],
    "correctIndex": 0,
    "explanation": "A Pedestrian Crossing warning sign alerts you that pedestrians regularly cross the road ahead — often at a mid-block crosswalk you may not yet see. Reduce speed and watch for pedestrians stepping into the roadway. The crosswalk markings may be ahead of you around a curve or over a hill.",
    "reference": "MUTCD Section 2C.50; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W11-1_PEDESTRIAN_CROSSING"
    }
  },
  {
    "id": "TX-SIG-0043",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "A BICYCLE CROSSING warning sign indicates:",
    "choices": [
      "Watch for bicycles crossing the roadway",
      "Bicycle lane begins",
      "No bicycles allowed",
      "Bicycle parking ahead"
    ],
    "correctIndex": 0,
    "explanation": "BICYCLE CROSSING signs warn drivers that bicycles may cross the road at that location, often marking bike paths or trails that cross the roadway.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W11-2_BICYCLE_CROSSING"
    }
  },
  {
    "id": "TX-SIG-0044",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a TRUCK CROSSING warning sign indicate?",
    "choices": [
      "Large trucks frequently cross or enter the roadway",
      "Truck stop ahead",
      "Trucks only beyond this point",
      "Truck route begins"
    ],
    "correctIndex": 0,
    "explanation": "TRUCK CROSSING signs warn that large commercial vehicles frequently cross or enter the road, often near industrial areas, quarries, or truck terminals.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W14-1_TRUCK_CROSSING"
    }
  },
  {
    "id": "TX-SIG-0045",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A FARM EQUIPMENT warning sign is most likely to be found:",
    "choices": [
      "In rural areas where slow-moving farm vehicles use the road",
      "Near agricultural supply stores",
      "On farm property only",
      "At farmer's markets"
    ],
    "correctIndex": 0,
    "explanation": "FARM EQUIPMENT signs warn drivers in rural areas to watch for slow-moving tractors, combines, and other agricultural machinery that may use the roadway.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W14-2_FARM_EQUIPMENT"
    }
  },
  {
    "id": "TX-SIG-0046",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "As you drive past houses near an elementary school, you see a yellow-green pentagon-shaped sign showing two children. What does this sign warn you about?",
    "choices": [
      "You are near a school — children may be crossing the road",
      "A playground is ahead — slow to 15 mph",
      "School buses stop frequently in this area",
      "A school zone speed camera is active ahead"
    ],
    "correctIndex": 0,
    "explanation": "The pentagon-shaped school sign (MUTCD S1-1) with the image of two children warns that a school area is ahead and children may be crossing the road. The yellow-green fluorescent color is designed for maximum daytime visibility. Be especially alert during school arrival and dismissal times, and watch for children who may dart into the street unexpectedly.",
    "reference": "MUTCD Section 7B.07; DL-7 Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_S1-1_SCHOOL_CROSSING"
    }
  },
  {
    "id": "TX-SIG-0047",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a SLIPPERY WHEN WET warning sign mean?",
    "choices": [
      "The road surface becomes slippery in wet conditions",
      "No driving allowed when raining",
      "Wet weather is common",
      "Water on roadway ahead"
    ],
    "correctIndex": 0,
    "explanation": "SLIPPERY WHEN WET signs warn that the road surface has poor traction when wet, requiring drivers to reduce speed and increase following distance in rainy conditions.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W16-2_SLIPPERY_WHEN_WET"
    }
  },
  {
    "id": "TX-SIG-0048",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a ROAD CONSTRUCTION warning sign indicate?",
    "choices": [
      "Workers and equipment may be on or near the roadway",
      "Road is closed",
      "Construction vehicles only",
      "Detour required"
    ],
    "correctIndex": 0,
    "explanation": "ROAD CONSTRUCTION signs warn of work zones ahead where workers, equipment, and changed traffic patterns require increased caution and reduced speed.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W20-1_ROAD_CONSTRUCTION"
    }
  },
  {
    "id": "TX-SIG-0049",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A FLAGGER AHEAD sign warns that:",
    "choices": [
      "A person will be directing traffic ahead",
      "Flags mark the road edge",
      "Flagpole in roadway",
      "Flag signals are used"
    ],
    "correctIndex": 0,
    "explanation": "FLAGGER AHEAD signs warn that a worker will be using a flag or paddle to manually direct traffic through a work zone, and you must obey their signals.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W20-7_FLAGGER_AHEAD"
    }
  },
  {
    "id": "TX-SIG-0050",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What color are warning signs typically?",
    "choices": [
      "Yellow or orange with black symbols",
      "Red with white symbols",
      "White with black symbols",
      "Green with white symbols"
    ],
    "correctIndex": 0,
    "explanation": "Warning signs are typically yellow with black symbols, or orange with black symbols in work zones, making them highly visible and distinct from regulatory signs.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0051",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "When you see a curve warning sign with an advisory speed plaque showing 35 mph:",
    "choices": [
      "35 mph is the recommended safe speed for that curve",
      "35 mph is the legal maximum in the curve",
      "35 mph applies only in wet conditions",
      "35 mph is for trucks only"
    ],
    "correctIndex": 0,
    "explanation": "Advisory speed plaques below curve signs show the recommended maximum safe speed for that curve under ideal conditions, though not a legal speed limit.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0052",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "A chevron sign in a curve indicates:",
    "choices": [
      "The direction and sharpness of the curve",
      "Speed limit in the curve",
      "One-way traffic through curve",
      "Curve ends ahead"
    ],
    "correctIndex": 0,
    "explanation": "Chevron signs with arrows are placed on the outside of sharp curves to guide drivers through the curve and indicate its direction, especially at night.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0053",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "If you see multiple CURVE warning signs in succession, this indicates:",
    "choices": [
      "Several curves following one another",
      "An extremely sharp single curve",
      "Alternative route available",
      "Curve under construction"
    ],
    "correctIndex": 0,
    "explanation": "Multiple curve warning signs placed sequentially indicate a series of curves ahead, each requiring careful speed management and attention.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0054",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "At a T-intersection, if there is no warning sign, who typically has the right-of-way?",
    "choices": [
      "Traffic on the through road (cross street)",
      "Traffic on the terminating road",
      "First vehicle to arrive",
      "Larger vehicle"
    ],
    "correctIndex": 0,
    "explanation": "At T-intersections, traffic on the through road (the road that continues) generally has the right-of-way over traffic on the terminating road, though signs or signals may specify otherwise.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0055",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A MERGE sign is different from a YIELD sign because:",
    "choices": [
      "MERGE warns of entering traffic; YIELD requires you to give way",
      "They mean the same thing",
      "MERGE requires stopping; YIELD does not",
      "YIELD is only at intersections"
    ],
    "correctIndex": 0,
    "explanation": "MERGE signs warn that traffic streams are combining and careful lane positioning is needed, while YIELD signs require you to give the right-of-way to others.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0056",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "When a PEDESTRIAN CROSSING sign is accompanied by a school crossing symbol, what does this indicate?",
    "choices": [
      "School children cross at this location",
      "Both school and public crossings are present",
      "The sign is in a school zone",
      "Crossing guards are present"
    ],
    "correctIndex": 0,
    "explanation": "When pedestrian crossing signs include school-related symbols, they specifically warn that school-age children cross at that location, requiring extra vigilance during school hours.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0057",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "In a work zone with both a posted speed limit and a ROAD CONSTRUCTION sign, which speed should you follow?",
    "choices": [
      "The posted work zone speed limit",
      "The regular speed limit",
      "Either, as they are the same",
      "Slower of the two"
    ],
    "correctIndex": 0,
    "explanation": "Work zones often have reduced speed limits posted on signs that override regular speed limits. Always follow the work zone speed limit when present.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0058",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A warning sign with a downward-pointing arrow symbol typically indicates:",
    "choices": [
      "Steep downgrade ahead",
      "Arrow direction to follow",
      "Lower speed required",
      "Downward exit ramp"
    ],
    "correctIndex": 0,
    "explanation": "Downward-pointing arrows on hill warning signs indicate steep downgrades where trucks may need to use lower gears and all vehicles should prepare for increased braking needs.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0059",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "Why are curve warning signs important in rural areas?",
    "choices": [
      "Higher speeds make curves more dangerous",
      "Curves are sharper in rural areas",
      "There are more curves in rural areas",
      "Rural drivers are less experienced"
    ],
    "correctIndex": 0,
    "explanation": "Rural roads often have higher speed limits, and curves at high speeds require advance warning so drivers can reduce speed appropriately before entering the curve.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0060",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "If a LANE ENDS MERGE sign shows the right lane ending, and both lanes are full, who should yield?",
    "choices": [
      "Traffic in the ending lane should yield",
      "Traffic in the continuing lane should yield",
      "Vehicles should alternate like a zipper",
      "Larger vehicles have priority"
    ],
    "correctIndex": 0,
    "explanation": "When a lane ends, traffic in the ending lane is responsible for safely merging into the continuing lane, yielding to traffic already in that lane.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0061",
    "topic": "SIGNS",
    "difficulty": 1,
    "text": "What does an Interstate highway sign look like?",
    "choices": [
      "Red, white, and blue shield shape",
      "Green rectangle",
      "Yellow diamond",
      "White circle"
    ],
    "correctIndex": 0,
    "explanation": "Interstate highway signs are distinctive red, white, and blue shields that display the Interstate route number, making them easily recognizable across the United States.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_I-5_INTERSTATE_35"
    }
  },
  {
    "id": "TX-SIG-0062",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does Interstate 10 signage indicate?",
    "choices": [
      "You are on a major cross-country highway",
      "The speed limit is 10 mph",
      "10 miles to destination",
      "Highway has 10 lanes"
    ],
    "correctIndex": 0,
    "explanation": "Interstate 10 is a major east-west transcontinental highway running from California to Florida, with significant portions running through Texas.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_I-5_INTERSTATE_10"
    }
  },
  {
    "id": "TX-SIG-0063",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What shape is a US Route highway sign?",
    "choices": [
      "White shield with black numbers",
      "Red and blue shield",
      "Green rectangle",
      "Yellow diamond"
    ],
    "correctIndex": 0,
    "explanation": "US Route signs are white shields with black route numbers, distinguishing them from Interstate signs and state route markers.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_M1-1_US_ROUTE_90"
    }
  },
  {
    "id": "TX-SIG-0064",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a State Route marker indicate in Texas?",
    "choices": [
      "A state-maintained highway route",
      "County road number",
      "City street designation",
      "Private road identifier"
    ],
    "correctIndex": 0,
    "explanation": "State Route markers designate highways maintained by the state of Texas, distinct from Interstate and US highways.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_M1-4_STATE_ROUTE_71"
    }
  },
  {
    "id": "TX-SIG-0065",
    "topic": "SIGNS",
    "difficulty": 1,
    "text": "What does an EXIT sign on a highway indicate?",
    "choices": [
      "An upcoming exit ramp to leave the highway",
      "Emergency exit only",
      "Exit the vehicle",
      "Express lane exit"
    ],
    "correctIndex": 0,
    "explanation": "EXIT signs mark exit ramps that allow drivers to leave the highway, typically showing the exit number and destination.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_D1-1_EXIT_SIGN"
    }
  },
  {
    "id": "TX-SIG-0066",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What information does a DISTANCE sign typically provide?",
    "choices": [
      "Miles to upcoming cities or destinations",
      "Distance to next exit",
      "Speed distance requirement",
      "Safe following distance"
    ],
    "correctIndex": 0,
    "explanation": "DISTANCE signs display the mileage to upcoming cities or destinations along the route, helping drivers plan their travel and exits.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_D3-1_DISTANCE_SIGN"
    }
  },
  {
    "id": "TX-SIG-0067",
    "topic": "SIGNS",
    "difficulty": 1,
    "text": "What does a REST AREA sign indicate?",
    "choices": [
      "A facility with parking and restrooms is ahead",
      "Rest required for tired drivers",
      "Area for resting vehicles",
      "Residential area ahead"
    ],
    "correctIndex": 0,
    "explanation": "REST AREA signs direct drivers to highway facilities offering parking, restrooms, and sometimes picnic areas for travelers to take breaks.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_D9-1_REST_AREA"
    }
  },
  {
    "id": "TX-SIG-0068",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a HOSPITAL sign indicate?",
    "choices": [
      "Medical facility location and direction",
      "Hospital zone - quiet required",
      "Emergency vehicles only",
      "Medical personnel parking"
    ],
    "correctIndex": 0,
    "explanation": "HOSPITAL signs with the H symbol direct drivers to nearby medical facilities, important for emergencies and wayfinding.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_D9-2_HOSPITAL"
    }
  },
  {
    "id": "TX-SIG-0069",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a GAS STATION service sign indicate?",
    "choices": [
      "Fuel services available at next exit or ahead",
      "Gas leak area",
      "Gas-powered vehicles only",
      "Gas station parking only"
    ],
    "correctIndex": 0,
    "explanation": "GAS STATION service signs inform drivers where fuel is available, typically indicating availability at upcoming exits on highways.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_D9-3_GAS_STATION"
    }
  },
  {
    "id": "TX-SIG-0070",
    "topic": "SIGNS",
    "difficulty": 1,
    "text": "What color are most guide and information signs?",
    "choices": [
      "Green with white lettering",
      "Blue with white lettering",
      "White with black lettering",
      "Brown with white lettering"
    ],
    "correctIndex": 0,
    "explanation": "Guide signs for highways and destinations are typically green with white lettering, making them easily distinguishable from regulatory and warning signs.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0071",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What is the difference between even and odd Interstate numbers?",
    "choices": [
      "Even numbers run east-west; odd numbers run north-south",
      "Even numbers are longer routes",
      "Odd numbers are in eastern states",
      "Even numbers are toll roads"
    ],
    "correctIndex": 0,
    "explanation": "The Interstate numbering system uses even numbers for east-west routes and odd numbers for north-south routes, helping with navigation across the country.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0072",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "Blue service signs typically indicate:",
    "choices": [
      "Food, gas, lodging, and other services",
      "Emergency services only",
      "Public services like libraries",
      "Business districts"
    ],
    "correctIndex": 0,
    "explanation": "Blue service signs direct drivers to traveler services such as gas stations, restaurants, hotels, and hospitals near highway exits.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0073",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "What do brown signs typically indicate?",
    "choices": [
      "Parks, recreational areas, and points of interest",
      "Construction zones",
      "Private property",
      "Unpaved roads"
    ],
    "correctIndex": 0,
    "explanation": "Brown signs mark recreational and cultural interest areas such as parks, historic sites, scenic areas, and tourist attractions.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0074",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "Mile marker signs help drivers by:",
    "choices": [
      "Providing location reference for navigation and emergencies",
      "Showing speed limits per mile",
      "Indicating miles to destination",
      "Marking speed enforcement zones"
    ],
    "correctIndex": 0,
    "explanation": "Mile markers show your location along a highway, helping with navigation and allowing you to report your exact location in emergencies.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0075",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "An EXIT ONLY lane sign means:",
    "choices": [
      "This lane must exit and cannot continue on the highway",
      "Only use this lane for exiting",
      "Exit is optional from this lane",
      "Entrance prohibited in this lane"
    ],
    "correctIndex": 0,
    "explanation": "EXIT ONLY signs indicate that the lane you are in will exit the highway and does not continue, requiring you to merge if you want to stay on the highway.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0076",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A three-digit Interstate number starting with an even digit (like I-210) typically indicates:",
    "choices": [
      "A loop or beltway around a city",
      "A spur route into a city",
      "A business route",
      "A temporary detour"
    ],
    "correctIndex": 0,
    "explanation": "Three-digit Interstate numbers beginning with even digits typically indicate loop routes or beltways that both begin and end at the parent Interstate.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0077",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A three-digit Interstate number starting with an odd digit (like I-335) typically indicates:",
    "choices": [
      "A spur route connecting to a city",
      "A complete loop around a city",
      "An alternate route",
      "A scenic route"
    ],
    "correctIndex": 0,
    "explanation": "Three-digit Interstate numbers beginning with odd digits typically indicate spur routes that connect to a city or area but do not return to the parent Interstate.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0078",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What should you do when you see a REST AREA sign and you feel drowsy?",
    "choices": [
      "Exit and take a break to rest before continuing",
      "Increase speed to reach destination faster",
      "Open windows and continue driving",
      "Drink coffee and keep driving"
    ],
    "correctIndex": 0,
    "explanation": "Drowsy driving is extremely dangerous. When you feel tired, the safest action is to exit at a rest area and take a break, nap, or stop for the night.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0079",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "When following Interstate 35 through Texas, you are traveling:",
    "choices": [
      "Generally north-south through central Texas",
      "East-west across northern Texas",
      "Along the Texas coast",
      "Through west Texas"
    ],
    "correctIndex": 0,
    "explanation": "Interstate 35 is a major north-south route running through central Texas from Laredo to the Oklahoma border, passing through San Antonio, Austin, and Dallas-Fort Worth.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0080",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "If you miss your intended highway exit, you should:",
    "choices": [
      "Continue to the next exit and backtrack safely",
      "Stop and reverse on the shoulder",
      "Cross multiple lanes quickly to exit",
      "Make a U-turn on the highway"
    ],
    "correctIndex": 0,
    "explanation": "Missing an exit is inconvenient but not dangerous. Never stop, reverse, or make unsafe maneuvers on a highway. Always continue to the next exit and find a safe alternate route.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0081",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What does a KEEP RIGHT sign in the center of a roadway indicate?",
    "choices": [
      "Traffic must pass to the right of an island or obstruction",
      "Slower traffic keep right",
      "Right lane only",
      "Right turn ahead"
    ],
    "correctIndex": 0,
    "explanation": "KEEP RIGHT signs placed on or near islands and obstructions direct drivers to pass on the right side of that object.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_OM1-1_KEEP_RIGHT"
    }
  },
  {
    "id": "TX-SIG-0082",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A KEEP LEFT sign would typically appear:",
    "choices": [
      "On an island or median to direct traffic left",
      "In the left lane only",
      "Before left turns",
      "At one-way streets"
    ],
    "correctIndex": 0,
    "explanation": "KEEP LEFT signs are placed on islands or obstructions to direct traffic to pass on the left side, similar to KEEP RIGHT signs but for the opposite direction.",
    "reference": "DL-7: Traffic Signs",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_OM2-1_KEEP_LEFT"
    }
  },
  {
    "id": "TX-SIG-0083",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "When approaching a curve with both a warning sign and chevron markers, you should:",
    "choices": [
      "Follow the chevron arrows while maintaining safe speed",
      "Ignore the chevrons and follow the center line",
      "Accelerate through the curve",
      "Stop before the curve"
    ],
    "correctIndex": 0,
    "explanation": "Chevron markers provide visual guidance through curves, especially at night. Follow the direction shown by the chevrons while maintaining a safe speed for the curve.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0084",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "If regulatory and warning signs give conflicting information, which should you follow?",
    "choices": [
      "Regulatory signs, as they indicate legal requirements",
      "Warning signs, as they indicate hazards",
      "The more restrictive of the two",
      "Neither, use your judgment"
    ],
    "correctIndex": 0,
    "explanation": "Regulatory signs indicate legal requirements that must be followed. Warning signs provide important safety information but regulatory signs take precedence for legal compliance.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0085",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "A sign showing a truck on a downgrade typically warns:",
    "choices": [
      "Steep hill where trucks may have brake problems",
      "Truck parking area",
      "Truck weighing station",
      "Truck loading zone"
    ],
    "correctIndex": 0,
    "explanation": "Signs showing trucks on downgrades warn of steep hills where large trucks may experience brake failure or reduced braking ability, requiring extra caution.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0086",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "When warning signs are placed on both sides of the road, this typically indicates:",
    "choices": [
      "The hazard affects both directions of travel",
      "Two-way traffic ahead",
      "Divided highway",
      "Passing is prohibited"
    ],
    "correctIndex": 0,
    "explanation": "When identical warning signs appear on both sides of the road, the hazard or condition they warn about typically affects traffic in both directions.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0087",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A pennant-shaped sign indicates:",
    "choices": [
      "No passing zone begins",
      "Sharp curve ahead",
      "Construction zone",
      "Reduced speed ahead"
    ],
    "correctIndex": 0,
    "explanation": "Pennant-shaped signs are uniquely used to mark the beginning of no-passing zones, positioned on the left side of the road where passing would occur.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0088",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "If you see a STOP sign with a white border versus one without, what is the difference?",
    "choices": [
      "No functional difference; both require a complete stop",
      "White border means four-way stop",
      "White border is optional stop",
      "White border indicates school zone"
    ],
    "correctIndex": 0,
    "explanation": "Older STOP signs sometimes have white borders, but this is only a design variation. All STOP signs require a complete stop regardless of border presence.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0089",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What does a sign with a circular red symbol typically indicate?",
    "choices": [
      "A prohibition or restriction",
      "A required action",
      "A warning",
      "A guide"
    ],
    "correctIndex": 0,
    "explanation": "Red circles on signs typically indicate prohibitions or restrictions, such as no parking, no turns, or no entry, following international sign conventions.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0090",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "At night, sign colors appear differently. Which sign color is most visible at night?",
    "choices": [
      "All are equally visible due to reflective materials",
      "Yellow signs",
      "White signs",
      "Green signs"
    ],
    "correctIndex": 0,
    "explanation": "Modern traffic signs use reflective materials that make all colors highly visible at night when illuminated by headlights, maintaining sign recognition regardless of color.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0091",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "Why are STOP signs red?",
    "choices": [
      "Red is the most attention-getting color indicating danger",
      "Red is easiest to see",
      "Red matches brake lights",
      "Tradition only"
    ],
    "correctIndex": 0,
    "explanation": "Red is universally recognized as the color of danger and prohibition, making it the appropriate choice for STOP signs which indicate a critical safety requirement.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0092",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A damaged or faded sign that is unreadable means:",
    "choices": [
      "Exercise extra caution and follow general traffic rules",
      "The sign can be ignored",
      "Speed limits no longer apply",
      "Traffic rules are suspended"
    ],
    "correctIndex": 0,
    "explanation": "Damaged signs do not negate traffic rules. If you cannot read a sign, exercise extra caution and follow general traffic laws and common sense for that situation.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0093",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "When two different speed limit signs are visible with different numbers, which applies?",
    "choices": [
      "The lower speed limit closest to you",
      "The higher speed limit",
      "The average of both",
      "Either one"
    ],
    "correctIndex": 0,
    "explanation": "When multiple speed limits are visible, follow the most recent sign you have passed, which typically shows the lower speed as you enter a reduced-speed zone.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0094",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "Why are some warning signs larger than others?",
    "choices": [
      "Larger signs are used where higher speeds require more advance warning",
      "Larger signs indicate more severe hazards",
      "Sign size is random",
      "Larger signs are newer"
    ],
    "correctIndex": 0,
    "explanation": "Warning sign size is determined by road speed and design standards. Higher-speed roads require larger signs for visibility at greater distances.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0095",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What should you do if a traffic light and a STOP sign are both present at an intersection?",
    "choices": [
      "Obey the traffic light when functioning; treat as stop when not",
      "Always stop for the sign",
      "The sign overrides the light",
      "Stop for both"
    ],
    "correctIndex": 0,
    "explanation": "When both a traffic signal and STOP sign are present, follow the traffic signal when it is functioning. If the signal is out, treat the intersection as an all-way stop.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0096",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "Work zone signs are typically what color?",
    "choices": [
      "Orange with black symbols",
      "Yellow with black symbols",
      "Red with white symbols",
      "White with black symbols"
    ],
    "correctIndex": 0,
    "explanation": "Work zone and construction signs use orange backgrounds with black symbols to distinguish them from permanent warning signs and increase visibility in work areas.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0097",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "At an intersection with a YIELD sign and a vehicle approaching from your right, you should:",
    "choices": [
      "Yield to the vehicle on your right",
      "Proceed if you arrived first",
      "Both vehicles should stop",
      "Larger vehicle has priority"
    ],
    "correctIndex": 0,
    "explanation": "YIELD signs require you to give the right-of-way to other vehicles. When in doubt, vehicles on your right generally have priority at intersections.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0098",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A sign reading 'ROAD CLOSED' means:",
    "choices": [
      "Do not enter; the road is impassable or dangerous",
      "Road closed to trucks only",
      "Proceed with extreme caution",
      "Closed during certain hours"
    ],
    "correctIndex": 0,
    "explanation": "ROAD CLOSED signs indicate the road is impassable or dangerous due to construction, flooding, or other hazards. Do not proceed beyond this sign.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0099",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What does 'REDUCED SPEED AHEAD' mean?",
    "choices": [
      "The speed limit will decrease soon",
      "Slow down immediately",
      "Speed reduction recommended",
      "Construction ahead"
    ],
    "correctIndex": 0,
    "explanation": "REDUCED SPEED AHEAD warning signs alert you that a lower speed limit sign is coming up, giving you time to slow down before reaching the new limit.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0100",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "A 'DETOUR' sign indicates:",
    "choices": [
      "Follow alternate route due to road closure",
      "Optional scenic route",
      "Truck route available",
      "Parking area ahead"
    ],
    "correctIndex": 0,
    "explanation": "DETOUR signs direct drivers to an alternate route when the regular road is closed or impassable, with additional signs guiding you back to your original route.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0101",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What does a 'CROSS TRAFFIC DOES NOT STOP' sign mean?",
    "choices": [
      "You have a stop sign but cross traffic does not",
      "Cross traffic must stop",
      "Four-way stop ahead",
      "No cross traffic present"
    ],
    "correctIndex": 0,
    "explanation": "This sign warns that while you must stop, vehicles on the cross street do not have stop signs and will continue through the intersection.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0102",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A black and white circular sign with 'RR' and an 'X' indicates:",
    "choices": [
      "Railroad crossing ahead",
      "Restricted road",
      "Rural route",
      "Repair required"
    ],
    "correctIndex": 0,
    "explanation": "The circular railroad crossing sign (crossbuck) warns that train tracks cross the road, requiring you to look both ways and be prepared to stop for trains.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0103",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "If you encounter a sign you do not recognize or understand, you should:",
    "choices": [
      "Proceed with caution and research the sign later",
      "Stop immediately",
      "Ignore it and continue",
      "Turn around"
    ],
    "correctIndex": 0,
    "explanation": "Unknown signs should prompt increased caution. Proceed carefully, observe traffic behavior, and look up the sign meaning when safe to do so.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0104",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "Why do some areas have multiple speed limit signs close together?",
    "choices": [
      "To ensure visibility after passing points and for emphasis",
      "Speed limits change frequently",
      "Different limits for different lanes",
      "Signs are redundant"
    ],
    "correctIndex": 0,
    "explanation": "Multiple speed limit signs are placed to ensure drivers entering from side streets or parking lots see the limit, and to reinforce compliance in critical areas.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0105",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A sign showing two arrows pointing in opposite directions indicates:",
    "choices": [
      "Two-way traffic or divided highway ends",
      "Two lanes merge",
      "Two exits ahead",
      "Turn either direction"
    ],
    "correctIndex": 0,
    "explanation": "Signs with opposing arrows warn that a one-way or divided highway is ending and you will encounter two-way traffic, requiring extra caution.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0106",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does an 'EMERGENCY PARKING ONLY' sign mean?",
    "choices": [
      "Park here only for vehicle emergencies",
      "Emergency vehicles may park here",
      "Parking available 24/7",
      "Short-term parking allowed"
    ],
    "correctIndex": 0,
    "explanation": "EMERGENCY PARKING ONLY areas are designated for vehicles experiencing mechanical problems or other emergencies, not for regular parking or rest stops.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0107",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A 'BRIDGE ICES BEFORE ROAD' sign warns that:",
    "choices": [
      "Bridge surfaces freeze before regular roadway in cold weather",
      "Bridge is always icy",
      "Ice on bridge ahead",
      "Bridge closed in winter"
    ],
    "correctIndex": 0,
    "explanation": "Bridges freeze before regular road surfaces because cold air circulates above and below them, making them more hazardous in near-freezing temperatures.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0108",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "What is the purpose of a 'PHOTO ENFORCED' sign below a traffic signal?",
    "choices": [
      "Cameras monitor and ticket traffic violations",
      "Photography prohibited",
      "Surveillance area",
      "Photo ID required"
    ],
    "correctIndex": 0,
    "explanation": "PHOTO ENFORCED signs warn that cameras monitor the intersection and automatically photograph vehicles running red lights or violating other traffic laws.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0109",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "If a speed limit sign has the words 'NIGHT' or 'NIGHTTIME' on it, this means:",
    "choices": [
      "A different speed limit applies during nighttime hours",
      "Night driving prohibited",
      "Lights required",
      "Night construction"
    ],
    "correctIndex": 0,
    "explanation": "Some areas have reduced nighttime speed limits due to decreased visibility or increased pedestrian activity, with specific hours typically indicated on the sign.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0110",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A 'TRUCKS USE RIGHT LANE' sign means:",
    "choices": [
      "Commercial trucks should stay in the right lane",
      "All vehicles use right lane",
      "Trucks turning right only",
      "Right lane for trucks only"
    ],
    "correctIndex": 0,
    "explanation": "These signs direct large commercial trucks to use the right lane, typically on hills or multi-lane highways to improve traffic flow and safety.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0111",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "What does a 'SOFT SHOULDER' sign indicate?",
    "choices": [
      "The road edge is unpaved and may not support vehicle weight",
      "Shoulder suitable for parking",
      "Shoulder maintenance ahead",
      "Soft road surface"
    ],
    "correctIndex": 0,
    "explanation": "SOFT SHOULDER signs warn that the area beyond the pavement edge is unpaved and may be unstable, potentially causing loss of control if you drive onto it.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0112",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "A sign reading 'SLOWER TRAFFIC KEEP RIGHT' is:",
    "choices": [
      "A suggestion for courtesy but not legally enforceable",
      "A legal requirement in all states",
      "For trucks only",
      "Enforceable during rush hour only"
    ],
    "correctIndex": 0,
    "explanation": "While SLOWER TRAFFIC KEEP RIGHT promotes safety and traffic flow, it is generally advisory. However, most states have laws against impeding traffic in left lanes.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0113",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What does a 'DIP' warning sign indicate?",
    "choices": [
      "A low place in the road where water may collect",
      "Road curves down",
      "Deep pothole",
      "Ditch alongside road"
    ],
    "correctIndex": 0,
    "explanation": "DIP signs warn of a depression in the roadway where water may accumulate during rain and where vehicles may bottom out if taken at high speed.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0114",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A 'BUMP' warning sign means:",
    "choices": [
      "A raised area in the pavement ahead",
      "Speed bump ahead",
      "Rough road",
      "Railroad crossing"
    ],
    "correctIndex": 0,
    "explanation": "BUMP signs warn of raised areas in the pavement that can cause vehicles to become airborne or lose control if taken at excessive speed.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0115",
    "topic": "SIGNS",
    "difficulty": 2,
    "text": "What does a 'DIVIDED HIGHWAY BEGINS' sign indicate?",
    "choices": [
      "The road ahead will have a median separating opposing traffic",
      "Highway splits into two roads",
      "Multiple lanes ahead",
      "Divided speed limits ahead"
    ],
    "correctIndex": 0,
    "explanation": "DIVIDED HIGHWAY BEGINS signs warn that the road ahead will have a median or barrier separating traffic traveling in opposite directions.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0116",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "A 'DIVIDED HIGHWAY ENDS' sign warns that:",
    "choices": [
      "Two-way traffic with no median is ahead",
      "Highway is ending",
      "Lanes are merging",
      "Speed limit ending"
    ],
    "correctIndex": 0,
    "explanation": "DIVIDED HIGHWAY ENDS signs warn that the median will end and oncoming traffic will share the same roadway, requiring increased caution for head-on traffic.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0117",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "What does 'PAVEMENT ENDS' mean?",
    "choices": [
      "Paved road surface changes to gravel or dirt ahead",
      "Road ends ahead",
      "Pavement damage ahead",
      "Construction zone"
    ],
    "correctIndex": 0,
    "explanation": "PAVEMENT ENDS signs warn that the paved surface ends and becomes gravel or dirt, requiring reduced speed and increased following distance.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0118",
    "topic": "SIGNS",
    "difficulty": 5,
    "text": "A regulatory sign with a white arrow on blue background indicates:",
    "choices": [
      "Direction of required travel or movement",
      "Information only",
      "Optional direction",
      "Pedestrian direction"
    ],
    "correctIndex": 0,
    "explanation": "Blue signs with white arrows are regulatory and indicate mandatory direction of travel, commonly seen on one-way streets or for required turn movements.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0119",
    "topic": "SIGNS",
    "difficulty": 3,
    "text": "What does 'SIGNAL AHEAD' warn you about?",
    "choices": [
      "A traffic light is coming up",
      "Emergency signals ahead",
      "Signal for help",
      "Railroad signal ahead"
    ],
    "correctIndex": 0,
    "explanation": "SIGNAL AHEAD signs warn that a traffic light is approaching, often used where signals are unexpected or on high-speed roads to allow drivers to prepare to stop.",
    "reference": "DL-7: Traffic Signs"
  },
  {
    "id": "TX-SIG-0120",
    "topic": "SIGNS",
    "difficulty": 4,
    "text": "A 'STOP AHEAD' warning sign is used when:",
    "choices": [
      "A stop sign is not visible until you are very close to it",
      "Stop sign visibility is good",
      "Stop is optional",
      "Four-way stop ahead"
    ],
    "correctIndex": 0,
    "explanation": "STOP AHEAD warning signs are placed where the actual stop sign may be hidden by curves, hills, or vegetation, giving drivers advance warning to prepare to stop.",
    "reference": "DL-7: Traffic Signs"
  }
]
