[
  {
    "id": "TX-SPC-0001",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "When a school bus stops with flashing red lights and an extended stop sign on an undivided roadway, vehicles in both directions must:",
    "choices": [
      "Stop and remain stopped until the lights stop flashing",
      "Slow to 20 mph and proceed with caution",
      "Stop only if on the same side as the bus",
      "Stop only if children are visible"
    ],
    "correctIndex": 0,
    "explanation": "On an undivided roadway, all vehicles in both directions must stop and remain stopped until the school bus's red lights stop flashing and the stop sign is retracted. This protects children crossing the street.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "INTERSECTION_SCHOOL_BUS_STOPPED"
    }
  },
  {
    "id": "TX-SPC-0002",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "You are traveling on a divided highway with a raised concrete median barrier. A school bus on the opposite side stops with red lights flashing. What should you do?",
    "choices": [
      "Continue driving at normal speed since the barrier separates traffic",
      "Stop until the bus turns off its lights",
      "Slow to 20 mph until past the bus",
      "Stop only if the median is less than 5 feet wide"
    ],
    "correctIndex": 0,
    "explanation": "On a divided highway with a physical barrier or median at least 5 feet wide, vehicles on the opposite side do not need to stop for a school bus. The barrier provides adequate separation and children cannot cross.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0003",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You see a school bus ahead stopped with its red lights flashing and stop arm extended. You are on the same undivided two-lane road. How far back must you stop?",
    "choices": [
      "At least 20 feet from the bus",
      "At least 10 feet from the bus",
      "Directly behind the bus is sufficient",
      "At least 50 feet from the bus"
    ],
    "correctIndex": 0,
    "explanation": "Texas law requires all vehicles on an undivided road to stop at least 20 feet from a school bus displaying flashing red lights. This 20-foot buffer gives children a safe zone to cross the road and protects them from vehicles that might not see them behind the bus.",
    "reference": "Texas Transportation Code §545.066; DL-7 Special Driving Situations"
  },
  {
    "id": "TX-SPC-0004",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "When driving through an active school zone with flashing signals, the speed limit is typically:",
    "choices": [
      "15 to 20 mph when children are present",
      "25 mph regardless of conditions",
      "30 mph during school hours only",
      "10 mph at all times"
    ],
    "correctIndex": 0,
    "explanation": "School zone speed limits are typically reduced to 15-20 mph when children are present or when school zone signals are flashing. These reduced speeds give drivers more time to react to children.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_S4-3_SCHOOL_SPEED_LIMIT_20"
    }
  },
  {
    "id": "TX-SPC-0005",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 4,
    "text": "A school bus ahead of you is slowing down with amber (yellow) warning lights flashing. What does this indicate?",
    "choices": [
      "The bus is preparing to stop to load or unload children",
      "The bus is experiencing mechanical problems",
      "You should pass the bus quickly before it stops",
      "The bus is turning at the next intersection"
    ],
    "correctIndex": 0,
    "explanation": "Amber warning lights on a school bus indicate the driver is preparing to stop to load or unload children. You should slow down and prepare to stop when the red lights begin flashing.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0006",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "What is the penalty range for illegally passing a stopped school bus with flashing red lights in Texas?",
    "choices": [
      "$500 to $1,250 fine",
      "$100 to $300 fine",
      "$250 to $500 fine",
      "$1,000 to $2,000 fine"
    ],
    "correctIndex": 0,
    "explanation": "Texas imposes significant penalties for passing a stopped school bus, with fines ranging from $500 to $1,250. These heavy penalties reflect the serious danger this violation poses to children.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0007",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "When are school zone speed limits typically in effect?",
    "choices": [
      "When posted signs or flashing lights indicate, usually 30 minutes before and after school",
      "Only during the exact start and end times of school",
      "From 7 AM to 7 PM on school days",
      "24 hours a day when school is in session"
    ],
    "correctIndex": 0,
    "explanation": "School zone speed limits are typically enforced when posted times indicate or when signals are flashing, usually starting 30 minutes before school begins and ending 30 minutes after school ends.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_S1-1_SCHOOL_CROSSING"
    }
  },
  {
    "id": "TX-SPC-0008",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You are driving on a two-lane undivided road. A school bus coming toward you activates its flashing red lights. Must you stop?",
    "choices": [
      "Yes — on an undivided road, traffic from both directions must stop for a school bus with red lights",
      "No — only vehicles behind the bus must stop",
      "Only if children are visibly crossing the road",
      "Only if you are within 50 feet of the bus"
    ],
    "correctIndex": 0,
    "explanation": "On an undivided road (no physical median barrier), vehicles traveling in BOTH directions must stop when a school bus displays flashing red lights. Children may cross from either side. The only exception is roads with a physical dividing barrier (such as a raised median), where oncoming traffic is not required to stop.",
    "reference": "Texas Transportation Code §545.066; DL-7 Special Driving Situations"
  },
  {
    "id": "TX-SPC-0009",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "You are on a four-lane road with a painted center turn lane. A school bus on the opposite side stops with red lights flashing. What must you do?",
    "choices": [
      "Stop, because a painted median does not divide the roadway",
      "Continue, because the turn lane separates traffic",
      "Slow to 20 mph but continue driving",
      "Stop only if children are crossing"
    ],
    "correctIndex": 0,
    "explanation": "A painted center turn lane or painted median does not divide a roadway. You must stop for a school bus with flashing red lights regardless of which side of the road you are on unless there is a physical barrier or median at least 5 feet wide.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0010",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "When a school bus stop sign is extended and red lights are flashing, when can you proceed?",
    "choices": [
      "When the lights stop flashing and the stop sign is retracted",
      "When the last child has boarded the bus",
      "After waiting 10 seconds at a complete stop",
      "When the bus driver waves you forward"
    ],
    "correctIndex": 0,
    "explanation": "You must remain stopped until both the red lights stop flashing and the stop sign is fully retracted. Only then is it safe to proceed, as this signals all children have safely crossed.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0011",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 4,
    "text": "While driving in a school zone, you see a crossing guard holding up a stop sign. What should you do?",
    "choices": [
      "Stop immediately and remain stopped until the guard signals it is safe to proceed",
      "Slow to 10 mph and proceed carefully around the guard",
      "Stop only if children are in the crosswalk",
      "Honk to alert the guard and proceed slowly"
    ],
    "correctIndex": 0,
    "explanation": "A crossing guard has the authority to stop traffic to protect children. You must stop immediately when a guard signals and wait until the guard indicates it is safe to proceed.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0012",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "What does a pentagon-shaped yellow sign with black symbols indicate?",
    "choices": [
      "A school zone or school crossing ahead",
      "A railroad crossing ahead",
      "A construction zone ahead",
      "A pedestrian crossing ahead"
    ],
    "correctIndex": 0,
    "explanation": "Pentagon-shaped signs are unique to school zones and school crossings. The distinctive five-sided shape makes these signs easily recognizable so drivers can prepare to watch for children.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_SCHOOL_ZONE"
    }
  },
  {
    "id": "TX-SPC-0013",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "A school bus is stopped ahead with alternating flashing red lights but the stop sign is not yet extended. What should you do?",
    "choices": [
      "Stop immediately, as flashing red lights require you to stop",
      "Continue driving since the stop sign is not out",
      "Slow down and prepare to stop",
      "Pass quickly before the stop sign extends"
    ],
    "correctIndex": 0,
    "explanation": "Flashing red lights on a school bus require you to stop immediately, regardless of whether the stop sign is extended. The lights are the primary signal that children are loading or unloading.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0014",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You are driving through a school zone at 20 mph during dismissal time. Several children are walking on the sidewalk, and one child appears to be chasing a ball toward the curb. What should you expect?",
    "choices": [
      "The child may run into the street without looking — be prepared to stop immediately",
      "The child will stop at the curb and look both ways",
      "The crossing guard will intervene before the child reaches the street",
      "Other children will stop them before they enter the roadway"
    ],
    "correctIndex": 0,
    "explanation": "Children are unpredictable and often focus on play rather than traffic safety. A child chasing a ball is very likely to run into the street without checking for vehicles. In school zones, always expect the unexpected and be ready to stop instantly. Reaction time at 20 mph gives you about 30 feet of stopping distance.",
    "reference": "DL-7 Special Driving Situations"
  },
  {
    "id": "TX-SPC-0015",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 5,
    "text": "You are on a highway with five lanes: two in each direction and a center turn lane. A school bus stops on the opposite side with red lights flashing. What is required?",
    "choices": [
      "You must stop because the center turn lane does not create a divided highway",
      "You can continue because there are multiple lanes separating you",
      "You must slow to 20 mph but need not stop",
      "You must stop only if the bus is directly across from you"
    ],
    "correctIndex": 0,
    "explanation": "Unless there is a physical barrier or median at least 5 feet wide, the roadway is not considered divided. A center turn lane is painted only, so all traffic must stop for a school bus with flashing red lights.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0016",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You approach a railroad crossing with flashing red lights and the crossing gate is lowering. You stop your vehicle. What distance from the nearest rail should you maintain?",
    "choices": [
      "Between 15 and 50 feet from the nearest rail",
      "Between 5 and 10 feet from the nearest rail",
      "At least 100 feet from the nearest rail",
      "As close as the gate allows"
    ],
    "correctIndex": 0,
    "explanation": "Texas law requires you to stop between 15 and 50 feet from the nearest railroad rail. Stopping closer than 15 feet puts you dangerously close to the train's path, as trains extend beyond the rails. Stopping beyond 50 feet could put you too far back to see clearly when it is safe to proceed.",
    "reference": "Texas Transportation Code §545.251; DL-7 Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "SPECIAL_RAILROAD_STOP_PROCEDURE"
    }
  },
  {
    "id": "TX-SPC-0017",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You must stop at a railroad crossing when:",
    "choices": [
      "Lights are flashing, gates are lowering, or a train is visible or audible",
      "Only when a train is visible",
      "Only when gates are completely down",
      "Only when a flag person signals you to stop"
    ],
    "correctIndex": 0,
    "explanation": "You must stop at a railroad crossing when warning lights flash, gates are lowering, a train is approaching or visible, or a flag person signals. Any of these conditions indicates an approaching train.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R15-1_RAILROAD_CROSSING"
    }
  },
  {
    "id": "TX-SPC-0018",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "While crossing railroad tracks, your vehicle becomes stalled on the tracks. What is the first thing you should do?",
    "choices": [
      "Get everyone out of the vehicle immediately and move away from the tracks",
      "Try to restart the vehicle",
      "Call 911 from inside the vehicle",
      "Put the vehicle in neutral and try to push it off the tracks"
    ],
    "correctIndex": 0,
    "explanation": "If your vehicle stalls on railroad tracks, immediately get everyone out and move far away from the tracks, preferably in the direction the train is coming from. Lives are more important than the vehicle.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0019",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "When crossing railroad tracks, you should:",
    "choices": [
      "Not shift gears while on the tracks",
      "Speed up to cross as quickly as possible",
      "Stop on the tracks to look both ways",
      "Cross at an angle to reduce the distance"
    ],
    "correctIndex": 0,
    "explanation": "Never shift gears while crossing railroad tracks because your vehicle could stall. Cross in the gear you are already in and wait until you have completely cleared the tracks before shifting.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0020",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You see a round yellow sign with a black X and the letters RR while driving on an unfamiliar country road. What should you do?",
    "choices": [
      "Slow down, look and listen for trains — a railroad crossing is ahead",
      "Watch for a rest area entrance on the right",
      "Prepare for a roundabout ahead",
      "Yield to cross traffic at the next intersection"
    ],
    "correctIndex": 0,
    "explanation": "The round yellow advance warning sign with the black X and RR is the Railroad Advance Warning sign (MUTCD W10-1). It tells you a railroad crossing is ahead, giving you time to slow down and prepare to stop if a train is approaching. On rural roads, crossings may not have gates or flashing lights, making this advance warning critical.",
    "reference": "MUTCD Section 8B.04; DL-7 Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_R15-1_RAILROAD_CROSSING"
    }
  },
  {
    "id": "TX-SPC-0021",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 4,
    "text": "After one train passes at a railroad crossing with multiple tracks, you should:",
    "choices": [
      "Check for a second train on other tracks before crossing",
      "Cross immediately before another train comes",
      "Wait at least 30 seconds before crossing",
      "Cross only when the gates fully rise"
    ],
    "correctIndex": 0,
    "explanation": "At crossings with multiple tracks, a second train may be approaching on another track. Always check all tracks in both directions before crossing, even after one train has passed.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0022",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "Is it legal to drive around lowered railroad crossing gates?",
    "choices": [
      "No, it is illegal and extremely dangerous",
      "Yes, if you can see no train is coming",
      "Yes, if you are already partially across when gates lower",
      "Yes, if the lights stop flashing"
    ],
    "correctIndex": 0,
    "explanation": "Driving around lowered railroad gates is illegal and extremely dangerous. Gates lower because a train is approaching, and going around them can result in a fatal collision.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0023",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "Before crossing railroad tracks, you should make sure:",
    "choices": [
      "You can completely clear all tracks without stopping",
      "No other vehicles are crossing at the same time",
      "Your vehicle is in first gear",
      "Your windows are rolled down to hear trains"
    ],
    "correctIndex": 0,
    "explanation": "Before starting to cross railroad tracks, make sure there is enough space on the other side for your entire vehicle to clear all tracks without stopping. Never stop on the tracks.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0024",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "After your vehicle is stalled on railroad tracks and everyone has evacuated, what should you do next?",
    "choices": [
      "Call 911 and provide the crossing number posted on the signal equipment",
      "Return to the vehicle and try to start it again",
      "Wait by the tracks for the police to arrive",
      "Try to flag down passing vehicles for help"
    ],
    "correctIndex": 0,
    "explanation": "After evacuating a stalled vehicle on tracks, immediately call 911 and give them the crossing number (posted on the signal or nearby). This helps railroad operators stop any approaching trains.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0025",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You are stopped at a railroad crossing with flashing red lights. After a train passes, the lights continue to flash. What should you do?",
    "choices": [
      "Remain stopped — a second train may be approaching from the other direction",
      "Proceed carefully after the first train has fully passed",
      "Inch forward slowly to check if the track is clear",
      "Wait exactly 30 seconds after the train passes, then proceed"
    ],
    "correctIndex": 0,
    "explanation": "If the red lights continue flashing after a train passes, another train may be approaching on a different track. Never proceed while the warning lights are active, even if you just saw a train go by. Multi-track crossings are common, and a second train can arrive from the opposite direction within seconds.",
    "reference": "Texas Transportation Code §545.251; DL-7 Special Driving Situations"
  },
  {
    "id": "TX-SPC-0026",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 4,
    "text": "What is the minimum distance you must park from railroad tracks?",
    "choices": [
      "100 feet",
      "50 feet",
      "75 feet",
      "150 feet"
    ],
    "correctIndex": 0,
    "explanation": "Texas law requires parking at least 100 feet away from railroad tracks. This distance prevents your vehicle from being struck by passing trains and keeps the crossing clear for other traffic.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0027",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "You see a pavement marking with a large X and two R's at an intersection. This indicates:",
    "choices": [
      "Railroad tracks cross the road ahead",
      "Do not enter this intersection",
      "Reversible lanes ahead",
      "Restricted parking zone"
    ],
    "correctIndex": 0,
    "explanation": "The X with RR pavement marking warns drivers that railroad tracks cross the roadway. This marking provides an additional visual warning to prepare drivers to stop if a train is approaching.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "PAVEMENT_RAILROAD_CROSSING_X"
    }
  },
  {
    "id": "TX-SPC-0028",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "When approaching railroad tracks, you should always:",
    "choices": [
      "Look both directions before crossing, even if no warning signals are present",
      "Trust the warning signals to alert you to approaching trains",
      "Cross quickly to minimize time on the tracks",
      "Stop completely regardless of signals or gates"
    ],
    "correctIndex": 0,
    "explanation": "Always look both ways before crossing railroad tracks, even if there are no signals or if signals are not activated. Signals can malfunction, and trains may approach unexpectedly.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0029",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 5,
    "text": "If you cannot get your vehicle off railroad tracks and you can see or hear a train approaching, you should move away from the tracks:",
    "choices": [
      "In the direction the train is coming from, at an angle away from the tracks",
      "In the direction the train is traveling",
      "Perpendicular to the tracks on either side",
      "Directly away from your vehicle"
    ],
    "correctIndex": 0,
    "explanation": "Move in the direction the train is coming from at an angle away from the tracks. This protects you from debris that will fly in the direction the train is traveling when it strikes your vehicle.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0030",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "At a railroad crossing without gates or flashing lights, you must:",
    "choices": [
      "Slow down, look both ways, and be prepared to stop",
      "Always come to a complete stop",
      "Proceed at normal speed if no train is visible",
      "Sound your horn before crossing"
    ],
    "correctIndex": 0,
    "explanation": "At passive railroad crossings (no gates or lights), you must slow down, look carefully in both directions, and be prepared to stop if a train is approaching. Not all crossings have warning devices.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0031",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "What does an orange diamond-shaped sign indicate?",
    "choices": [
      "Work zone or construction area ahead",
      "School zone ahead",
      "Railroad crossing ahead",
      "Detour ahead"
    ],
    "correctIndex": 0,
    "explanation": "Orange diamond-shaped signs indicate temporary work zones or construction areas. These signs warn drivers to prepare for changed conditions, workers, and equipment on or near the roadway.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W20-1_ROAD_CONSTRUCTION"
    }
  },
  {
    "id": "TX-SPC-0032",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You are driving through a highway work zone and see workers and equipment near the road. You notice a sign saying 'Fines Doubled.' If you are cited for speeding here, how are the fines affected?",
    "choices": [
      "The fine is doubled compared to the normal amount for that violation",
      "The fine remains the same but points on your license are doubled",
      "The fine is tripled in active work zones",
      "Fines are only doubled if a worker is injured"
    ],
    "correctIndex": 0,
    "explanation": "Texas law doubles traffic fines in active work zones where workers are present. This applies to speeding, failure to obey traffic control devices, and other moving violations. The doubled fines serve as a deterrent because work zone crashes are disproportionately fatal — workers have no protection from passing vehicles.",
    "reference": "Texas Transportation Code §542.404; DL-7 Special Driving Situations"
  },
  {
    "id": "TX-SPC-0033",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "When you see a flagger holding a STOP paddle, you must:",
    "choices": [
      "Stop immediately and remain stopped until the flagger signals you to proceed",
      "Slow to 10 mph and proceed with caution",
      "Stop, then proceed if the way looks clear",
      "Stop only if workers are in the roadway"
    ],
    "correctIndex": 0,
    "explanation": "A flagger with a STOP paddle has the same authority as a stop sign. You must stop immediately and wait until the flagger uses the SLOW paddle or signals you to proceed.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "SPECIAL_WORK_ZONE_FLAGGER"
    }
  },
  {
    "id": "TX-SPC-0034",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "Under Texas Move Over Law, when you see a stopped emergency vehicle with flashing lights on the roadside, you must:",
    "choices": [
      "Change lanes away from the vehicle, or slow to 20 mph below the limit if you cannot change lanes",
      "Slow to 20 mph regardless of which lane you are in",
      "Stop completely until the vehicle leaves",
      "Change lanes only if directed by emergency personnel"
    ],
    "correctIndex": 0,
    "explanation": "Texas Move Over Law requires drivers to change lanes away from stopped emergency vehicles with flashing lights. If you cannot change lanes safely, you must slow to 20 mph below the posted limit.",
    "reference": "DL-7: Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "INTERSECTION_EMERGENCY_VEHICLE"
    }
  },
  {
    "id": "TX-SPC-0035",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "A flagger displays a SLOW paddle. What should you do?",
    "choices": [
      "Reduce your speed and proceed with caution",
      "Come to a complete stop",
      "Maintain your current speed",
      "Slow to exactly 20 mph"
    ],
    "correctIndex": 0,
    "explanation": "When a flagger displays a SLOW paddle (orange), reduce your speed and proceed with caution. Be prepared to stop if conditions require or if the flagger changes to a STOP signal.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0036",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 4,
    "text": "If the posted speed limit is 25 mph or less and you cannot change lanes away from a stopped emergency vehicle, how much must you slow down?",
    "choices": [
      "To 5 mph",
      "To 10 mph",
      "To 15 mph",
      "To 20 mph below the limit"
    ],
    "correctIndex": 0,
    "explanation": "Under Texas Move Over Law, if the posted limit is 25 mph or less and you cannot change lanes, you must slow to 5 mph. For higher speed limits, slow to 20 mph below the posted limit.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0037",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "You are driving through a construction zone on a highway. The lanes are narrower than usual, cones line both sides, and workers are operating equipment near the right shoulder. What is the safest approach?",
    "choices": [
      "Reduce speed, stay centered in your lane, and watch for workers or equipment entering the roadway",
      "Speed up to exit the work zone as quickly as possible",
      "Change lanes frequently to find the lane with the least cones",
      "Follow the vehicle ahead as closely as possible to prevent other cars from cutting in"
    ],
    "correctIndex": 0,
    "explanation": "In work zones, reduce speed to account for narrow lanes and unexpected hazards. Stay centered in your lane to maintain maximum clearance from cones and barriers. Watch for workers, equipment, and sudden lane shifts. Work zone crashes kill hundreds of drivers and workers each year, and most are caused by speeding and inattention.",
    "reference": "DL-7 Special Driving Situations"
  },
  {
    "id": "TX-SPC-0038",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "What is the maximum fine for violating the Texas Move Over Law?",
    "choices": [
      "$2,000",
      "$500",
      "$1,000",
      "$5,000"
    ],
    "correctIndex": 0,
    "explanation": "Violating Texas Move Over Law can result in fines up to $2,000. If the violation results in property damage, bodily injury, or death, penalties are even more severe.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0039",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "Which vehicles are covered under the Texas Move Over Law?",
    "choices": [
      "Police, fire, EMS, tow trucks, and TxDOT vehicles with flashing lights",
      "Only police and fire vehicles",
      "Only emergency medical vehicles",
      "Any vehicle with hazard lights on"
    ],
    "correctIndex": 0,
    "explanation": "Texas Move Over Law applies to police, fire, EMS, tow trucks, and TxDOT maintenance vehicles when they are stopped with flashing lights. This protects all roadside workers and emergency personnel.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0040",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "When approaching a work zone where lanes are merging, you should:",
    "choices": [
      "Merge early and avoid unnecessary lane changes",
      "Continue in your lane until the last possible moment",
      "Speed up to merge ahead of other traffic",
      "Change lanes multiple times to find the fastest route"
    ],
    "correctIndex": 0,
    "explanation": "Merge early when approaching lane closures in work zones. This reduces congestion and dangerous last-minute lane changes, making the work zone safer for everyone.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0041",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "A flagger extends their arm horizontally. This signal means:",
    "choices": [
      "Stop",
      "Slow down",
      "Proceed",
      "Prepare to stop"
    ],
    "correctIndex": 0,
    "explanation": "When a flagger extends their arm horizontally, this is a stop signal. You must stop immediately and remain stopped until the flagger signals you to proceed.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0042",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "As you approach a highway construction area, you see an orange diamond sign with a figure of a person holding a flag. What does this sign indicate?",
    "choices": [
      "A flagger is ahead directing traffic — prepare to slow or stop as directed",
      "A flag ceremony is being held near the road",
      "Pedestrian crossing ahead within the work zone",
      "A road survey crew is working and may be standing in the lane"
    ],
    "correctIndex": 0,
    "explanation": "The orange Flagger Ahead sign (MUTCD W20-7) warns that a flagger is controlling traffic ahead, typically because of lane closures or alternating one-way traffic in the work zone. Slow down and be prepared to stop. The flagger's directions have the force of law — you must obey them just like a traffic signal.",
    "reference": "MUTCD Section 6E.03; DL-7 Special Driving Situations",
    "image": {
      "type": "svg",
      "assetId": "MUTCD_W20-7_FLAGGER_AHEAD"
    }
  },
  {
    "id": "TX-SPC-0043",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 4,
    "text": "When a flagger waves a flag in a vertical up-and-down motion, you should:",
    "choices": [
      "Slow down",
      "Stop immediately",
      "Proceed at normal speed",
      "Speed up to clear the area"
    ],
    "correctIndex": 0,
    "explanation": "A vertical up-and-down flag motion from a flagger signals drivers to slow down. This is different from the STOP paddle and indicates caution is needed but you may continue at reduced speed.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0044",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "In work zones, you should NOT:",
    "choices": [
      "Change lanes unnecessarily",
      "Obey reduced speed limits",
      "Watch for workers",
      "Follow posted detour signs"
    ],
    "correctIndex": 0,
    "explanation": "Avoid unnecessary lane changes in work zones. Frequent lane changes increase the risk of collisions and can endanger workers. Stay in your lane unless you must merge due to lane closures.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0045",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "You must treat a flagger's signals the same as:",
    "choices": [
      "Official traffic control signals",
      "Suggestions for safer driving",
      "Warning signs only",
      "Advisory speed limits"
    ],
    "correctIndex": 0,
    "explanation": "Flaggers have the same authority as traffic control signals. You must obey their directions just as you would obey a stop sign or traffic light. Failure to obey can result in citations.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0046",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "Your car's engine suddenly dies while you are in the right lane of a busy highway. You can still steer and brake. What is the safest course of action?",
    "choices": [
      "Steer to the right shoulder, activate hazard lights, and raise the hood to signal distress",
      "Stop immediately in your lane and turn on hazard lights",
      "Try to restart the engine while coasting in the travel lane",
      "Coast to the left shoulder for better visibility to approaching traffic"
    ],
    "correctIndex": 0,
    "explanation": "When your vehicle breaks down on a highway, use your remaining momentum to steer safely onto the right shoulder, as far from traffic as possible. Activate your hazard lights immediately to warn other drivers. Raising the hood is a universal signal of a disabled vehicle. Stopping in a travel lane or the left shoulder exposes you to high-speed rear-end collisions.",
    "reference": "DL-7 Special Driving Situations"
  },
  {
    "id": "TX-SPC-0047",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "If you experience a tire blowout while driving, you should:",
    "choices": [
      "Grip the wheel firmly, avoid sudden braking, and let the vehicle slow naturally",
      "Brake hard immediately to stop quickly",
      "Accelerate to maintain control",
      "Turn sharply toward the shoulder"
    ],
    "correctIndex": 0,
    "explanation": "During a tire blowout, grip the wheel firmly, avoid sudden braking, and let the vehicle slow down naturally. Steer straight and brake gently once speed is reduced, then pull off the road safely.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0048",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "If your brakes fail while driving, you should first:",
    "choices": [
      "Pump the brake pedal rapidly several times",
      "Pull the parking brake hard",
      "Turn off the engine",
      "Shift into neutral"
    ],
    "correctIndex": 0,
    "explanation": "If brakes fail, first pump the brake pedal rapidly to build up brake fluid pressure. This may restore enough braking power to slow or stop. If this fails, downshift and use the parking brake gradually.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0049",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "If your vehicle catches fire, you should:",
    "choices": [
      "Pull over immediately, get everyone out, move far away, and call 911",
      "Drive to the nearest fire station",
      "Try to put out the fire with a portable extinguisher",
      "Open the hood to see where the fire is"
    ],
    "correctIndex": 0,
    "explanation": "If your vehicle catches fire, immediately pull over, evacuate everyone, move far from the vehicle, and call 911. Vehicle fires spread rapidly and the vehicle may explode. Never open the hood of a car with an engine fire.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0050",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 1,
    "text": "If you are involved in a crash, you must:",
    "choices": [
      "Stop immediately at the scene or nearby",
      "Continue to the nearest police station",
      "Exchange information only if someone is injured",
      "Leave if the other driver agrees it was minor"
    ],
    "correctIndex": 0,
    "explanation": "Texas law requires you to stop immediately after any crash. Leaving the scene is a hit-and-run crime with serious penalties, even for minor crashes with no injuries.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0051",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "After a crash, you must report it to police if:",
    "choices": [
      "There are injuries or property damage exceeding $1,000",
      "Any vehicle needs to be towed",
      "Airbags deployed in any vehicle",
      "More than two vehicles are involved"
    ],
    "correctIndex": 0,
    "explanation": "Texas law requires crash reports when there are injuries, deaths, or property damage exceeding $1,000. File the report within 10 days of the crash, even if police did not come to the scene.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0052",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "If your vehicle is broken down on a busy highway, you should generally:",
    "choices": [
      "Stay in your vehicle with doors locked until help arrives",
      "Stand behind your vehicle to warn other drivers",
      "Walk to the nearest exit to call for help",
      "Accept rides from passing motorists"
    ],
    "correctIndex": 0,
    "explanation": "On busy highways, it is generally safer to stay inside your locked vehicle with your seatbelt on until help arrives. Standing outside puts you at risk of being struck by passing vehicles.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0053",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 4,
    "text": "If you must exit your disabled vehicle on a highway, you should:",
    "choices": [
      "Exit through the passenger side door away from traffic",
      "Exit through the driver's side door",
      "Exit only after stopping all traffic with hand signals",
      "Wait until emergency vehicles arrive to exit"
    ],
    "correctIndex": 0,
    "explanation": "If you must exit a disabled vehicle on a highway, use the passenger side door to exit away from traffic. This reduces your risk of being struck by passing vehicles.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0054",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "After a crash, you should exchange which information with the other driver?",
    "choices": [
      "Name, address, phone number, insurance information, and driver license number",
      "Only insurance information",
      "Only name and phone number",
      "Only insurance and vehicle registration"
    ],
    "correctIndex": 0,
    "explanation": "After a crash, exchange names, addresses, phone numbers, insurance information, and driver license numbers with all involved parties. This information is needed for insurance claims and police reports.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0055",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "If you encounter a hazardous materials spill on the roadway, you should:",
    "choices": [
      "Stay upwind and uphill from the spill, do not touch it, and call 911",
      "Drive through it quickly to avoid prolonged exposure",
      "Stop and help injured people immediately",
      "Place warning flares near the spill to alert others"
    ],
    "correctIndex": 0,
    "explanation": "Hazardous materials spills can be deadly. Stay upwind and uphill to avoid fumes, do not touch the material, and immediately call 911. Let trained hazmat teams handle the situation.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0056",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 1,
    "text": "After a crash with no injuries, should you move the vehicles if they are blocking traffic?",
    "choices": [
      "Yes, if it is safe to do so, move vehicles to the shoulder",
      "No, never move vehicles until police arrive",
      "Yes, always move vehicles immediately regardless of conditions",
      "No, leave vehicles in place to preserve evidence"
    ],
    "correctIndex": 0,
    "explanation": "If there are no injuries and it is safe to do so, Texas law requires you to move vehicles to the shoulder to prevent additional crashes. Take photos first if possible for insurance purposes.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0057",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 4,
    "text": "If your brakes fail and pumping does not restore pressure, you should next:",
    "choices": [
      "Downshift to a lower gear to use engine braking",
      "Turn off the ignition immediately",
      "Swerve side to side to slow down",
      "Drive off the road into a ditch"
    ],
    "correctIndex": 0,
    "explanation": "If pumping the brakes does not work, downshift to a lower gear to use engine braking to slow the vehicle. Then gradually apply the parking brake. Look for an escape route such as an uphill area or open space.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0058",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 2,
    "text": "If you are involved in a crash, you should NOT:",
    "choices": [
      "Admit fault or apologize at the scene",
      "Check for injuries to all parties",
      "Call 911 if anyone is hurt",
      "Exchange insurance information"
    ],
    "correctIndex": 0,
    "explanation": "Never admit fault or apologize at the scene of a crash, as statements can be used against you later. Stick to facts when exchanging information and let insurance companies and authorities determine fault.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0059",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 3,
    "text": "If you have warning triangles or flares after a breakdown, you should place them:",
    "choices": [
      "Behind your vehicle at increasing distances to warn approaching traffic",
      "In front of your vehicle only",
      "Under your vehicle to mark its location",
      "On top of your vehicle for better visibility"
    ],
    "correctIndex": 0,
    "explanation": "Place warning triangles or flares behind your vehicle at increasing distances (such as 10, 100, and 200 feet) to give approaching drivers advance warning. This helps prevent additional crashes.",
    "reference": "DL-7: Special Driving Situations"
  },
  {
    "id": "TX-SPC-0060",
    "topic": "SPECIAL_SITUATIONS",
    "difficulty": 5,
    "text": "If you are the first to arrive at a crash scene with injured people, your first priority should be to:",
    "choices": [
      "Call 911 and keep injured people still unless they are in immediate danger",
      "Move all injured people away from vehicles immediately",
      "Give first aid before calling for emergency help",
      "Direct traffic around the crash scene"
    ],
    "correctIndex": 0,
    "explanation": "At a crash scene, first call 911 to get professional help on the way. Keep injured people still unless there is immediate danger like fire, as moving them can worsen injuries. Let trained medical personnel provide treatment.",
    "reference": "DL-7: Special Driving Situations"
  }
]
